andelf/bl702-pac/svd/bl702.svd
					<register>
						<name>DIG32K_WAKEUP_CTRL</name>
						<description>DIG32K_WAKEUP_CTRL.</description>
						<addressOffset>0xA8</addressOffset>
						<fields>
							<field>
								<name>reg_en_platform_wakeup</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>dig_clk_src_sel</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>dig_512k_comp</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>dig_512k_en</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>dig_512k_div</name>
								<lsb>16</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>dig_32k_comp</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>dig_32k_en</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>dig_32k_div</name>
								<lsb>0</lsb>
								<msb>10</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>WIFI_BT_COEX_CTRL</name>
						<description>WIFI_BT_COEX_CTRL.</description>
						<addressOffset>0xAC</addressOffset>
						<fields>
							<field>
								<name>en_gpio_bt_coex</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>coex_bt_bw</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>coex_bt_pti</name>
								<lsb>7</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>coex_bt_channel</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>BZ_COEX_CTRL</name>
						<description>BZ_COEX_CTRL.</description>
						<addressOffset>0xB0</addressOffset>
						<fields>
							<field>
								<name>coex_arb</name>
								<lsb>28</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>ble_tx_abort_dis</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>ble_rx_abort_dis</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>m154_tx_abort_dis</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>m154_rx_abort_dis</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>coex_force_ch</name>
								<lsb>16</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>coex_option</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>force_ble_win</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>force_m154_win</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>coex_pri</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>bz_abort_pol</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>bz_active_pol</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>bz_pri_pol</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>bz_pri_en</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>bz_pri_thr</name>
								<lsb>4</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>m154_rx_ignore</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>ble_rx_ignore</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>wlan_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>coex_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>UART_SIG_SEL_0</name>
						<description>UART_SIG_SEL_0.</description>
						<addressOffset>0xC0</addressOffset>
						<fields>
							<field>
								<name>uart_sig_7_sel</name>
								<lsb>28</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>uart_sig_6_sel</name>
								<lsb>24</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>uart_sig_5_sel</name>
								<lsb>20</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>uart_sig_4_sel</name>
								<lsb>16</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>uart_sig_3_sel</name>
								<lsb>12</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>uart_sig_2_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>uart_sig_1_sel</name>
								<lsb>4</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>uart_sig_0_sel</name>
								<lsb>0</lsb>
								<msb>3</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DBG_SEL_LL</name>
						<description>DBG_SEL_LL.</description>
						<addressOffset>0xD0</addressOffset>
						<fields>
							<field>
								<name>reg_dbg_ll_ctrl</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DBG_SEL_LH</name>
						<description>DBG_SEL_LH.</description>
						<addressOffset>0xD4</addressOffset>
						<fields>
							<field>
								<name>reg_dbg_lh_ctrl</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DBG_SEL_HL</name>
						<description>DBG_SEL_HL.</description>
						<addressOffset>0xD8</addressOffset>
						<fields>
							<field>
								<name>reg_dbg_hl_ctrl</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>DBG_SEL_HH</name>
						<description>DBG_SEL_HH.</description>
						<addressOffset>0xDC</addressOffset>
						<fields>
							<field>
								<name>reg_dbg_hh_ctrl</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>debug</name>
						<description>debug.</description>
						<addressOffset>0xE0</addressOffset>
						<fields>
							<field>
								<name>debug_i</name>
								<lsb>1</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>debug_oe</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL0</name>
						<description>GPIO_CFGCTL0.</description>
						<addressOffset>0x100</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_1_func_sel</name>
								<lsb>24</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>reg_gpio_1_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_1_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_1_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_1_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_1_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_0_func_sel</name>
								<lsb>8</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>reg_gpio_0_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_0_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_0_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_0_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_0_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL1</name>
						<description>GPIO_CFGCTL1.</description>
						<addressOffset>0x104</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_3_func_sel</name>
								<lsb>24</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>reg_gpio_3_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_3_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_3_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_3_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_3_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_2_func_sel</name>
								<lsb>8</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>reg_gpio_2_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_2_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_2_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_2_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_2_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL2</name>
						<description>GPIO_CFGCTL2.</description>
						<addressOffset>0x108</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_5_func_sel</name>
								<lsb>24</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>reg_gpio_5_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_5_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_5_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_5_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_5_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_4_func_sel</name>
								<lsb>8</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>reg_gpio_4_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_4_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_4_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_4_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_4_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL3</name>
						<description>GPIO_CFGCTL3.</description>
						<addressOffset>0x10C</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_7_func_sel</name>
								<lsb>24</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>reg_gpio_7_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_7_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_7_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_7_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_7_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_6_func_sel</name>
								<lsb>8</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>reg_gpio_6_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_6_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_6_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_6_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_6_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL4</name>
						<description>GPIO_CFGCTL4.</description>
						<addressOffset>0x110</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_9_func_sel</name>
								<lsb>24</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>reg_gpio_9_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_9_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_9_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_9_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_9_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_8_func_sel</name>
								<lsb>8</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>reg_gpio_8_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_8_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_8_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_8_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_8_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL5</name>
						<description>GPIO_CFGCTL5.</description>
						<addressOffset>0x114</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_11_func_sel</name>
								<lsb>24</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>reg_gpio_11_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_11_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_11_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_11_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_11_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_10_func_sel</name>
								<lsb>8</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>reg_gpio_10_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_10_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_10_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_10_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_10_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL6</name>
						<description>GPIO_CFGCTL6.</description>
						<addressOffset>0x118</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_13_func_sel</name>
								<lsb>24</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>reg_gpio_13_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_13_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_13_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_13_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_13_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_12_func_sel</name>
								<lsb>8</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>reg_gpio_12_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_12_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_12_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_12_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_12_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL7</name>
						<description>GPIO_CFGCTL7.</description>
						<addressOffset>0x11C</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_15_func_sel</name>
								<lsb>24</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>reg_gpio_15_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_15_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_15_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_15_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_15_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_14_func_sel</name>
								<lsb>8</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>reg_gpio_14_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_14_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_14_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_14_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_14_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL8</name>
						<description>GPIO_CFGCTL8.</description>
						<addressOffset>0x120</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_17_func_sel</name>
								<lsb>24</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>reg_gpio_17_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_17_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_17_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_17_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_17_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_16_func_sel</name>
								<lsb>8</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>reg_gpio_16_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_16_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_16_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_16_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_16_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL9</name>
						<description>GPIO_CFGCTL9.</description>
						<addressOffset>0x124</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_19_func_sel</name>
								<lsb>24</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>reg_gpio_19_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_19_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_19_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_19_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_19_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_18_func_sel</name>
								<lsb>8</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>reg_gpio_18_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_18_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_18_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_18_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_18_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL10</name>
						<description>GPIO_CFGCTL10.</description>
						<addressOffset>0x128</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_21_func_sel</name>
								<lsb>24</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>reg_gpio_21_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_21_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_21_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_21_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_21_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_20_func_sel</name>
								<lsb>8</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>reg_gpio_20_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_20_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_20_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_20_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_20_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
