andelf/bl702-pac/svd/bl702.svd
				</registers>
			</peripheral>
			<peripheral>
				<name>rf</name>
				<description>rf.</description>
				<baseAddress>0x40001000</baseAddress>
				<groupName>rf</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>rf_rev</name>
						<description>Silicon revision</description>
						<addressOffset>0x0</addressOffset>
						<fields>
							<field>
								<name>hw_rev</name>
								<lsb>16</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>fw_rev</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>rf_rev</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dsp_readback</name>
						<description>dsp_readback.</description>
						<addressOffset>0x4</addressOffset>
						<fields>
							<field>
								<name>rbb_bw_ind_ctrl_hw</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>rbb_bw_ind</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>rbb_ind_ctrl_hw</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>rbb_ind</name>
								<lsb>24</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>ch_ind_ctrl_hw</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>ch_ind</name>
								<lsb>16</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>rbb_bw_ind_hw</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>rbb_ind_hw</name>
								<lsb>9</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>ch_ind_hw</name>
								<lsb>2</lsb>
								<msb>8</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_ctrl_source</name>
						<description>Control logic switch</description>
						<addressOffset>0x8</addressOffset>
						<fields>
							<field>
								<name>vco_idac_ctrl_hw</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>inc_fcal_en_ctrl_hw</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>lo_fcw_ctrl_hw</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>rbb_bw_ctrl_hw</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>kcal_ratio_ctrl_hw</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>rosdac_ctrl_rccal</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>rosdac_ctrl_hw</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>gain_ctrl_rx_hw</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>gain_ctrl_tx_hw</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>pu_ctrl_hw</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_cal_state_ctrl</name>
						<description>rf calibration state enable in full cal list</description>
						<addressOffset>0xC</addressOffset>
						<fields>
							<field>
								<name>inc_roscal_state_en</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>inc_acal_state_en</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>inc_fcal_state_en</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>rccal_state_en</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>roscal_state_en</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>kcal_state_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>acal_state_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>fcal_state_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_cal_switch_ctrl</name>
						<description>Calibration mode register</description>
						<addressOffset>0x10</addressOffset>
						<fields>
							<field>
								<name>inc_fcal_en_hw</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>inc_fcal_en</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>inc_acal_en</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>rccal_en</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>kcal_en</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>acal_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_cal_status</name>
						<description>rf_cal_status.</description>
						<addressOffset>0x14</addressOffset>
						<fields>
							<field>
								<name>dl_rfcal_table_status</name>
								<lsb>30</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>rccal_status</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>roscal_status</name>
								<lsb>6</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>kcal_status</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>acal_status</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pu_delay_confg</name>
						<description>pu_delay_confg.</description>
						<addressOffset>0x18</addressOffset>
						<fields>
							<field>
								<name>adpll_reset_width</name>
								<lsb>20</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>lo_reset_width</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>lo_reset_delay</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>pud_delay</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>ppu_lead</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pucr_reg</name>
						<description>Register control of power up signals</description>
						<addressOffset>0x100</addressOffset>
						<fields>
							<field>
								<name>rst_fbdv</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>rst_lotpm_hfp</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>rst_adpll</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>pa_seri_cap_en</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>rx_bypass_en</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>pu_pa</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>pu_lna</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>pu_rmx</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>pu_rbb</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>pu_rbb_pkdet</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>pu_rosdac</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>pu_rxadc</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>rxadc_clk_en</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>pu_lodist_body_bias</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>pu_vco_ldo</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>pu_vco</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>pu_fbdv</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>pu_fbdv_buf</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>lotpm_hfp_clk_en</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>lotpm_lfp_bypass</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>lotpm_hfp_bypass</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>adpll_clk_en</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>pu_adpll_adc</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>pu_adpll_sfreg</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>pu_dtc</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>pu_rxbuf</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>pu_txbuf</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>lodist_tx_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pucr_sb</name>
						<description>Power up setting in SB state</description>
						<addressOffset>0x104</addressOffset>
						<fields>
							<field>
								<name>pa_seri_cap_en_sb</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>rx_bypass_en_sb</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>pu_pa_sb</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>pu_lna_sb</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>pu_rmx_sb</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>pu_rbb_sb</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>pu_rbb_pkdet_sb</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>pu_rosdac_sb</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>pu_rxadc_sb</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>rxadc_clk_en_sb</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>pu_lodist_body_bias_sb</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>pu_vco_ldo_sb</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>pu_vco_sb</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>pu_fbdv_sb</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>pu_fbdv_buf_sb</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>lotpm_hfp_clk_en_sb</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>lotpm_lfp_bypass_sb</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>lotpm_hfp_bypass_sb</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>adpll_clk_en_sb</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>pu_adpll_adc_sb</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>pu_adpll_sfreg_sb</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>pu_dtc_sb</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>pu_rxbuf_sb</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>pu_txbuf_sb</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>lodist_tx_en_sb</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pucr_lotx</name>
						<description>Power up in LOTX state</description>
						<addressOffset>0x108</addressOffset>
						<fields>
							<field>
								<name>pa_seri_cap_en_lotx</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>rx_bypass_en_lotx</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>pu_pa_lotx</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>pu_lna_lotx</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>pu_rmx_lotx</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>pu_rbb_lotx</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>pu_rbb_pkdet_lotx</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>pu_rosdac_lotx</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>pu_rxadc_lotx</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>rxadc_clk_en_lotx</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>pu_lodist_body_bias_lotx</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>pu_vco_ldo_lotx</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>pu_vco_lotx</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>pu_fbdv_lotx</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>pu_fbdv_buf_lotx</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>lotpm_hfp_clk_en_lotx</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>lotpm_lfp_bypass_lotx</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>lotpm_hfp_bypass_lotx</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>adpll_clk_en_lotx</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>pu_adpll_adc_lotx</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>pu_adpll_sfreg_lotx</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>pu_dtc_lotx</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>pu_rxbuf_lotx</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>pu_txbuf_lotx</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>lodist_tx_en_lotx</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pucr_lorx</name>
						<description>Power up in LORX state</description>
						<addressOffset>0x10C</addressOffset>
						<fields>
							<field>
								<name>pa_seri_cap_en_lorx</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>rx_bypass_en_lorx</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>pu_pa_lorx</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>pu_lna_lorx</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>pu_rmx_lorx</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>pu_rbb_lorx</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>pu_rbb_pkdet_lorx</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>pu_rosdac_lorx</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>pu_rxadc_lorx</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>rxadc_clk_en_lorx</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>pu_lodist_body_bias_lorx</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>pu_vco_ldo_lorx</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>pu_vco_lorx</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>pu_fbdv_lorx</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>pu_fbdv_buf_lorx</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>lotpm_hfp_clk_en_lorx</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>lotpm_lfp_bypass_lorx</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>lotpm_hfp_bypass_lorx</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>adpll_clk_en_lorx</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>pu_adpll_adc_lorx</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>pu_adpll_sfreg_lorx</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>pu_dtc_lorx</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>pu_rxbuf_lorx</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>pu_txbuf_lorx</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>lodist_tx_en_lorx</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pucr_tx</name>
						<description>Power up in TX state</description>
						<addressOffset>0x110</addressOffset>
						<fields>
							<field>
								<name>pa_seri_cap_en_tx</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>rx_bypass_en_tx</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>pu_pa_tx</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>pu_lna_tx</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>pu_rmx_tx</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>pu_rbb_tx</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>pu_rbb_pkdet_tx</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>pu_rosdac_tx</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>pu_rxadc_tx</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>rxadc_clk_en_tx</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>pu_lodist_body_bias_tx</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>pu_vco_ldo_tx</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>pu_vco_tx</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>pu_fbdv_tx</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>pu_fbdv_buf_tx</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>lotpm_hfp_clk_en_tx</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>lotpm_lfp_bypass_tx</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>lotpm_hfp_bypass_tx</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>adpll_clk_en_tx</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>pu_adpll_adc_tx</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>pu_adpll_sfreg_tx</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>pu_dtc_tx</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>pu_rxbuf_tx</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>pu_txbuf_tx</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>lodist_tx_en_tx</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
