andelf/bl702-pac/svd/bl702.svd
					<register>
						<name>pucr_rx</name>
						<description>Power up in RX state</description>
						<addressOffset>0x114</addressOffset>
						<fields>
							<field>
								<name>pa_seri_cap_en_rx</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>rx_bypass_en_rx</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>pu_pa_rx</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>pu_lna_rx</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>pu_rmx_rx</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>pu_rbb_rx</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>pu_rbb_pkdet_rx</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>pu_rosdac_rx</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>pu_rxadc_rx</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>rxadc_clk_en_rx</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>pu_lodist_body_bias_rx</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>pu_vco_ldo_rx</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>pu_vco_rx</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>pu_fbdv_rx</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>pu_fbdv_buf_rx</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>lotpm_hfp_clk_en_rx</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>lotpm_lfp_bypass_rx</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>lotpm_hfp_bypass_rx</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>adpll_clk_en_rx</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>pu_adpll_adc_rx</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>pu_adpll_sfreg_rx</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>pu_dtc_rx</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>pu_rxbuf_rx</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>pu_txbuf_rx</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>lodist_tx_en_rx</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pucr_hw</name>
						<description>Hardware read back of power up signals</description>
						<addressOffset>0x118</addressOffset>
						<fields>
							<field>
								<name>rst_fbdv_hw</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>rst_lotpm_hfp_hw</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>rst_adpll_hw</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>pa_seri_cap_en_hw</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>rx_bypass_en_hw</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>pu_pa_hw</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>pu_lna_hw</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>pu_rmx_hw</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>pu_rbb_hw</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>pu_rbb_pkdet_hw</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>pu_rosdac_hw</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>pu_rxadc_hw</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>rxadc_clk_en_hw</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>pu_lodist_body_bias_hw</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>pu_vco_ldo_hw</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>pu_vco_hw</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>pu_fbdv_hw</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>pu_fbdv_buf_hw</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>lotpm_hfp_clk_en_hw</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>lotpm_lfp_bypass_hw</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>lotpm_hfp_bypass_hw</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>adpll_clk_en_hw</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>pu_adpll_adc_hw</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>pu_adpll_sfreg_hw</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>pu_dtc_hw</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>pu_rxbuf_hw</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>pu_txbuf_hw</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>lodist_tx_en_hw</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>non_reg_readback</name>
						<description>non_reg_readback.</description>
						<addressOffset>0x11C</addressOffset>
						<fields>
							<field>
								<name>ppu_lna_hw</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>ppu_rbb_hw</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>ppu_lodist_body_bias_hw</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>ppu_vco_ldo_hw</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>ppu_vco_hw</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>pud_vco_hw</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>ppu_fbdv_hw</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>ppu_adpll_sfreg_hw</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>ppu_rxbuf_hw</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>ppu_txbuf_hw</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>ppu_testbuf_hw</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>trx_gain_bw</name>
						<description>Register control of TX/RX gain</description>
						<addressOffset>0x120</addressOffset>
						<fields>
							<field>
								<name>pa_inbuf_unit</name>
								<lsb>20</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>pa_ref_dac</name>
								<lsb>12</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>rbb_bw</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>gc_rbb2</name>
								<lsb>5</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>gc_rbb1</name>
								<lsb>3</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>gc_lna</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>trx_gain_bw_hw</name>
						<description>Hardware read back of TX/RX gain</description>
						<addressOffset>0x124</addressOffset>
						<fields>
							<field>
								<name>pa_inbuf_unit_hw</name>
								<lsb>20</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>pa_ref_dac_hw</name>
								<lsb>12</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>rbb_bw_hw</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>gc_rbb2_hw</name>
								<lsb>5</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>gc_rbb1_hw</name>
								<lsb>3</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>gc_lna_hw</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dctest_actest</name>
						<description>DC Test register 0</description>
						<addressOffset>0x128</addressOffset>
						<fields>
							<field>
								<name>ten_mbg</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>ten_dll</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>ten_lodist</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>ten_pa_0</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>ten_pa_1</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>ten_rrf0</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>ten_rrf1</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>ten_rxadc</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>ten_vco</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>ten_adpll_adc</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>ten_rbb_actest</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>ten_rbb</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>ten_dtc</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>atest_out_en</name>
								<lsb>6</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>dc_tp_out_en</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dtest</name>
						<description>LO Bias Mode registers</description>
						<addressOffset>0x12C</addressOffset>
						<fields>
							<field>
								<name>dtest_en_dtc_in</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>dtest_en_dtc_out</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>dtest_en_fref</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>dtest_en_mod4</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>dtest_en_adpll_adc</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>dtest_en_rxadc_i</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>dtest_en_rxadc_q</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>dtest_pulldown</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>adpll_test</name>
						<description>adpll_test.</description>
						<addressOffset>0x130</addressOffset>
						<fields>
							<field>
								<name>adpll_test_start</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>adpll_test_en</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>adpll_test_start_sel</name>
								<lsb>20</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>adpll_test_data_sel</name>
								<lsb>16</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>adpll_test_out</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_ext_pa</name>
						<description>rf_ext_pa.</description>
						<addressOffset>0x134</addressOffset>
						<fields>
							<field>
								<name>rf_ext_pa_rx</name>
								<lsb>20</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>rf_ext_pa_lorx</name>
								<lsb>15</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>rf_ext_pa_tx</name>
								<lsb>10</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>rf_ext_pa_lotx</name>
								<lsb>5</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>rf_ext_pa_sb</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>cip_ldo15</name>
						<description>cip_ldo15.</description>
						<addressOffset>0x200</addressOffset>
						<fields>
							<field>
								<name>vg11_sel</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pa</name>
						<description>PA register</description>
						<addressOffset>0x204</addressOffset>
						<fields>
							<field>
								<name>pa_force_short_open</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>pa_hp_en</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>pa_lp_en</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>pa_ldo_bm</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>pa_vdd11_sel</name>
								<lsb>20</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>pa_para_cs</name>
								<lsb>12</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>pa_seri_cs_hw</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>pa_seri_cs_rx</name>
								<lsb>4</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>pa_seri_cs_tx</name>
								<lsb>0</lsb>
								<msb>3</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lna_mx</name>
						<description>LNA mixer register</description>
						<addressOffset>0x208</addressOffset>
						<fields>
							<field>
								<name>lna_bm_hw</name>
								<lsb>28</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>lna_bm_hg</name>
								<lsb>24</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>lna_bm_lg</name>
								<lsb>20</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>lna_cap_lg</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>lna_cap_match</name>
								<lsb>15</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>lna_lg_gsel</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>lna_load_csw</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>lna_vdd13_sel</name>
								<lsb>6</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>lna_rfb_match</name>
								<lsb>3</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>rmx_bm</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_rosdac</name>
						<description>rbb_rosdac.</description>
						<addressOffset>0x20C</addressOffset>
						<fields>
							<field>
								<name>rosdac_i</name>
								<lsb>24</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>rosdac_q</name>
								<lsb>16</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>rosdac_i_hw</name>
								<lsb>8</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>rosdac_q_hw</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_cap_1</name>
						<description>rbb_cap_1.</description>
						<addressOffset>0x210</addressOffset>
						<fields>
							<field>
								<name>rbb_cap1_fc_i</name>
								<lsb>24</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>rbb_cap1_fc_q</name>
								<lsb>16</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>rbb_cap2_fc_i</name>
								<lsb>8</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>rbb_cap2_fc_q</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_cap_2</name>
						<description>rbb_cap_2.</description>
						<addressOffset>0x214</addressOffset>
						<fields>
							<field>
								<name>rbb_cap1_fc_i_hw</name>
								<lsb>24</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>rbb_cap1_fc_q_hw</name>
								<lsb>16</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>rbb_cap2_fc_i_hw</name>
								<lsb>8</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>rbb_cap2_fc_q_hw</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_cap_3</name>
						<description>rbb_cap_3.</description>
						<addressOffset>0x218</addressOffset>
						<fields>
							<field>
								<name>rbb_cap1_fc_i_bw0</name>
								<lsb>24</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>rbb_cap1_fc_q_bw0</name>
								<lsb>16</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>rbb_cap2_fc_i_bw0</name>
								<lsb>8</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>rbb_cap2_fc_q_bw0</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_cap4</name>
						<description>rbb_cap4.</description>
						<addressOffset>0x21C</addressOffset>
						<fields>
							<field>
								<name>rbb_cap1_fc_i_bw1</name>
								<lsb>24</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>rbb_cap1_fc_q_bw1</name>
								<lsb>16</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>rbb_cap2_fc_i_bw1</name>
								<lsb>8</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>rbb_cap2_fc_q_bw1</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_rx</name>
						<description>rbb_rx.</description>
						<addressOffset>0x220</addressOffset>
						<fields>
							<field>
								<name>rbb_rx1</name>
								<lsb>28</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>rbb_rx2</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>rbb_rx1_hw</name>
								<lsb>20</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>rbb_rx2_hw</name>
								<lsb>16</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>rbb_rx1_bw0</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>rbb_rx2_bw0</name>
								<lsb>8</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>rbb_rx1_bw1</name>
								<lsb>4</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>rbb_rx2_bw1</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb</name>
						<description>rbb.</description>
						<addressOffset>0x224</addressOffset>
						<fields>
							<field>
								<name>rbb_bm_op</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>rbb_vcm</name>
								<lsb>24</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>rbb_deq</name>
								<lsb>20</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>rbb_lpf_en</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>rosdac_range</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>rbb_pkdet_vth</name>
								<lsb>12</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>rbb_pkdet_en</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>rbb_pkdet_en_hw</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>rbb_pkdet_en_ctrl_hw</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>rbb_pkdet_out_rstn</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>rbb_pkdet_out_rstn_hw</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>rbb_pkdet_out_rstn_ctrl_hw</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>pkdet_out_raw</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>pkdet_out_latch</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rxadc</name>
						<description>rxadc.</description>
						<addressOffset>0x228</addressOffset>
						<fields>
							<field>
								<name>rxadc_dly_ctrl</name>
								<lsb>24</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>rxadc_glitch_remove</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>rxadc_clk_div_sel</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>rxadc_clk_inv</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>rxadc_clk_sync_inv</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>rxadc_vref_sel</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>rxadc_oscal_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rxadc_readback</name>
						<description>rxadc_readback.</description>
						<addressOffset>0x22C</addressOffset>
						<fields>
							<field>
								<name>rxadc_dout_i</name>
								<lsb>16</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>rxadc_dout_q</name>
								<lsb>0</lsb>
								<msb>8</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_adc_osdata</name>
						<description>rf_adc_osdata.</description>
						<addressOffset>0x230</addressOffset>
						<fields>
							<field>
								<name>rxadc_os_i</name>
								<lsb>16</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>rxadc_os_q</name>
								<lsb>0</lsb>
								<msb>8</msb>
							</field>
						</fields>
					</register>
