andelf/bl702-pac/svd/bl702.svd
					<register>
						<name>testbuf</name>
						<description>testbuf.</description>
						<addressOffset>0x234</addressOffset>
						<fields>
							<field>
								<name>pu_testbuf</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>testbuf_vcm</name>
								<lsb>20</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>testbuf_bm</name>
								<lsb>16</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>testbuf_boost</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>testbuf_op_cc</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>testbuf_rfb</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>testbuf_rin</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>vco</name>
						<description>vco.</description>
						<addressOffset>0x238</addressOffset>
						<fields>
							<field>
								<name>vco_acal_ud</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>vco_idac_hw</name>
								<lsb>24</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>vco_idac</name>
								<lsb>16</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>vco_ldo_bypass</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>vco_ldo_vsel</name>
								<lsb>13</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>vco_idac_boost</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>vco_vbias</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>vco_acal_vref</name>
								<lsb>4</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>vco_modcap_sel</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>vco_short_idac_filter</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>vco_short_vbias_filter</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lodist</name>
						<description>lodist.</description>
						<addressOffset>0x23C</addressOffset>
						<fields>
							<field>
								<name>lodist_75dc_sel</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>lodist_nwell_bias</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>lodist_rwell_bias</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>lodist_rxbuf_supply_boost</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>lodist_rxbuf_supply_mode</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>lodist_txbuf_supply_mode</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>fbdv</name>
						<description>fbdv.</description>
						<addressOffset>0x240</addressOffset>
						<fields>
							<field>
								<name>dco_dither_clk_polarity</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>lotpm_fmash_clk_polarity</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>rst_mmdiv</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>fbdv_stg_sel</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>fbdv_sample_clk_sel</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>fbdv_fb_clk_sel</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>fbdv_dco_dither_clk_sel</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>fbdv_adpll_clk_sel</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>fbdv_tpm_clk_sel</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>kcal1</name>
						<description>kcal1.</description>
						<addressOffset>0x244</addressOffset>
						<fields>
							<field>
								<name>kcal_ratio</name>
								<lsb>20</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>kcal_cnt_start</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>kcal_div</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>kcal2</name>
						<description>kcal2.</description>
						<addressOffset>0x248</addressOffset>
						<fields>
							<field>
								<name>kcal_ratio_hw</name>
								<lsb>20</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>kcal_cnt_rdy</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>kcal_cnt_op</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>adpll_slope_gen</name>
						<description>adpll_slope_gen.</description>
						<addressOffset>0x24C</addressOffset>
						<fields>
							<field>
								<name>adpll_slope_gen_pulse_width_enhance</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>adpll_slope_gen_dc_corr</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>adpll_slope_gen_r_sel</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>adpll_adc</name>
						<description>adpll_adc.</description>
						<addressOffset>0x250</addressOffset>
						<fields>
							<field>
								<name>adpll_adc_clk_en</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>adpll_adc_clk_inv</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>adpll_adc_clk_div_sel</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>adpll_adc_clk_sync_inv</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>adpll_adc_oscal_en</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>adpll_adc_vref_coarse</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>adpll_adc_vref_fine</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>adpll_adc_data_sign_sel</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>adpll_adc_vth_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>adpll_adc_vth_bias_mode</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>adpll_dtc</name>
						<description>adpll_dtc.</description>
						<addressOffset>0x254</addressOffset>
						<fields>
							<field>
								<name>adpll_dtc_inv_vth_sel</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>adpll_dtc_r_sel</name>
								<lsb>4</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>adpll_dtc_bypass</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_fc_config1</name>
						<description>lo_fc_config1.</description>
						<addressOffset>0x258</addressOffset>
						<fields>
							<field>
								<name>lo_fcw</name>
								<lsb>0</lsb>
								<msb>24</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_fcw_config2</name>
						<description>lo_fcw_config2.</description>
						<addressOffset>0x25C</addressOffset>
						<fields>
							<field>
								<name>lo_fcw_hw</name>
								<lsb>0</lsb>
								<msb>24</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_fcw3</name>
						<description>lo_fcw3.</description>
						<addressOffset>0x260</addressOffset>
						<fields>
							<field>
								<name>tx_freq_mod_hp</name>
								<lsb>16</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>tx_freq_mod_lp</name>
								<lsb>0</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lotpm</name>
						<description>lotpm.</description>
						<addressOffset>0x264</addressOffset>
						<fields>
							<field>
								<name>lotpm_hfp_mash1_sel</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>lotpm_hfp_polarity</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>lotpm_hfp_delay_fref</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>lotpm_hfp_delay_fmash</name>
								<lsb>4</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>lotpm_lfp_delay_sel</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>adpll1</name>
						<description>adpll1.</description>
						<addressOffset>0x268</addressOffset>
						<fields>
							<field>
								<name>adpll_force_inc_fcal_en</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>adpll_lo_unlock_intrpt_clear_sel</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>adpll_sfreg_sel</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>adpll_lo_open</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>adpll_mom_search_en_ext</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>adpll_freqerr_det_start_ext</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>adpll_mom_update_en_ext</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>adpll_vctrl_det_en_ext</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>adpll_vctrl_det_start_ext</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>adpll_abnormal_dealed</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>adpll_lock_fail_en</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>adpll_fsm_en</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>adpll_lo_fsm_ext</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>adpll_lo_lock_directly</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>adpll_fcal_start_ext</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>adpll_fcal_done_ext</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>adpll_loop_lock_ext</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>adpll_rst_spd_det_ext</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>adpll_rst_coarse_det_ext</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>adpll_momhold_lmsenb_ext</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>adpll_timeout_cnt_sel</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>adpll_timeout_cnt1_sel</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>adpll_lo_lock_sel</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>adpll_lo_unlock_intrpt_clear</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>adpll_lf_reg</name>
						<description>adpll_lf_reg.</description>
						<addressOffset>0x26C</addressOffset>
						<fields>
							<field>
								<name>adpll_lf_ctrl_hw</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>adpll_lf_alpha_base</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>adpll_lf_alpha_exp</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>adpll_lf_alpha_fast</name>
								<lsb>20</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>adpll_lf_beta_base</name>
								<lsb>17</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>adpll_lf_beta_exp</name>
								<lsb>14</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>adpll_lf_beta_fast</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>adpll_lf_f_p3</name>
								<lsb>10</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>adpll_lf_avg_en</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>adpll_lf_lsb_ext</name>
								<lsb>2</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>adpll_lf_vctrl_range_ext</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>adpll_lf_tx</name>
						<description>adpll_lf_tx.</description>
						<addressOffset>0x270</addressOffset>
						<fields>
							<field>
								<name>adpll_lf_alpha_base_tx</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>adpll_lf_alpha_exp_tx</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>adpll_lf_alpha_fast_tx</name>
								<lsb>20</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>adpll_lf_beta_base_tx</name>
								<lsb>17</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>adpll_lf_beta_exp_tx</name>
								<lsb>14</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>adpll_lf_beta_fast_tx</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>adpll_lf_f_p3_tx</name>
								<lsb>10</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>adpll_lf_rx</name>
						<description>adpll_lf_rx.</description>
						<addressOffset>0x274</addressOffset>
						<fields>
							<field>
								<name>adpll_lf_alpha_base_rx</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>adpll_lf_alpha_exp_rx</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>adpll_lf_alpha_fast_rx</name>
								<lsb>20</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>adpll_lf_beta_base_rx</name>
								<lsb>17</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>adpll_lf_beta_exp_rx</name>
								<lsb>14</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>adpll_lf_beta_fast_rx</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>adpll_lf_f_p3_rx</name>
								<lsb>10</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>adpll_lf_hw</name>
						<description>adpll_lf_hw.</description>
						<addressOffset>0x278</addressOffset>
						<fields>
							<field>
								<name>adpll_lf_alpha_base_hw</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>adpll_lf_alpha_exp_hw</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>adpll_lf_alpha_fast_hw</name>
								<lsb>20</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>adpll_lf_beta_base_hw</name>
								<lsb>17</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>adpll_lf_beta_exp_hw</name>
								<lsb>14</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>adpll_lf_beta_fast_hw</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>adpll_lf_f_p3_hw</name>
								<lsb>10</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>adpll_vctrl</name>
						<description>adpll_vctrl.</description>
						<addressOffset>0x27C</addressOffset>
						<fields>
							<field>
								<name>adpll_vctrl_range_sel_ext_en</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>adpll_vctrl_lock_win_sel</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>adpll_vctrl_moni_win_sel</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>adpll_vctrl_det_cons_en</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>adpll_mom_update_period</name>
								<lsb>20</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>adpll_force_mom_hold</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>adpll_dco_mash_bypass</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>adpll_capcode_bypass</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>sdm_order</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>sdm_dither</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>sdm_bypass</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>sdmout_dly_sel</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>adpll_lms</name>
						<description>adpll_lms.</description>
						<addressOffset>0x280</addressOffset>
						<fields>
							<field>
								<name>adpll_fref_div2_en</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>adpll_lms_ext_value_en</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>adpll_lms_ext_value</name>
								<lsb>20</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>adpll_sdm_dither_en</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>adpll_sdm_dither_en_ctrl_hw</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>adpll_lms_step</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>adpll_sdm_dither_prbs_en</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>adpll_pha_dem_en</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>adpll_pha_dither_en</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>adpll_lms_step_enlarge</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>adpll_pha_prbs_sel</name>
								<lsb>10</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>adpll_lms_q_delay</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>adpll_pha_cancel_en</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>adpll_pha_cancel_delay</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>adpll_spd</name>
						<description>adpll_spd.</description>
						<addressOffset>0x284</addressOffset>
						<fields>
							<field>
								<name>adpll_spd_in_range_delay_1</name>
								<lsb>30</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>adpll_coarsepha_dly_sel</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>adpll_force_coarse_path_on</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>adpll_spd_lms_sstp_win_sel</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>adpll_spd_outrange_dly_sel_ext</name>
								<lsb>25</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>adpll_coarse_path_offtime_sel</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>adpll_coarse_phaerr_en</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>adpll_force_lf_fast_mode_hw</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>adpll_force_lf_fast_mode</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>adpll_force_lf_fast_mode_ctrl_hw</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>adpll_coarse_gain</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>adpll_spd_gain</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>adpll_coarse_in_range_cons</name>
								<lsb>14</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>adpll_spd_threshold</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>adpll_coarse_path_turnoff</name>
								<lsb>10</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>adpll_spd_in_range_cons</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>adpll_spd_out_range_delay</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>adpll_spd_in_range_delay</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>fcal</name>
						<description>fcal.</description>
						<addressOffset>0x288</addressOffset>
						<fields>
							<field>
								<name>fcal_mom_ini_ext</name>
								<lsb>16</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>fcal_mode</name>
								<lsb>6</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>fcal_clk_period</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>fcal_mom_toggle_cnt</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>fcal_coarse_pha_threshold</name>
								<lsb>1</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>fcal_div_ratio_adj_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
