andelf/bl702-pac/svd/bl702.svd
					<register>
						<name>adpll_polarity</name>
						<description>adpll_polarity.</description>
						<addressOffset>0x28C</addressOffset>
						<fields>
							<field>
								<name>adpll_lp_polarity</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>adpll_fcal_polarity</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>adpll_lms_polarity</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>adpll_lp_mom_polarity</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>adpll_output</name>
						<description>adpll_output.</description>
						<addressOffset>0x290</addressOffset>
						<fields>
							<field>
								<name>adpll_freqerr_det_done</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>adpll_freqerr_ou</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>adpll_freqerr_sign</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>adpll_vctrl_det_done</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>adpll_capcode_ud</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>adpll_mom_update_total_ou</name>
								<lsb>15</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>adpll_capcode_out_range</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>adpll_fcal_done_fsm</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>adpll_spd_lock_fsm</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>adpll_spd_unlock_fsm</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>adpll_mom_update_ou_fsm</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>adpll_mom_update_fail_fsm</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>adpll_vctrl_out_range_fsm</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>adpll_spd_unlock_sign</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>adpll_fsm_state</name>
								<lsb>3</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>adpll_lo_lock</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>adpll_unlock_intrpt</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>adpll_reserved</name>
						<description>adpll_reserved.</description>
						<addressOffset>0x294</addressOffset>
						<fields>
							<field>
								<name>adpll_resv0</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>adpll_resv1</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_reserved</name>
						<description>rf_reserved.</description>
						<addressOffset>0x298</addressOffset>
						<fields>
							<field>
								<name>rf_resv0</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>rf_resv1</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_reserved_2</name>
						<description>rf_reserved_2.</description>
						<addressOffset>0x29C</addressOffset>
						<fields>
							<field>
								<name>rf_resv</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_gain_ctrl0</name>
						<description>rbb_gain_ctrl0.</description>
						<addressOffset>0x300</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl0_g_rbb1</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gain_ctrl0_g_rbb2</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>gain_ctrl0_rosdac_i_bw1</name>
								<lsb>18</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>gain_ctrl0_rosdac_q_bw1</name>
								<lsb>12</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>gain_ctrl0_rosdac_i_bw0</name>
								<lsb>6</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>gain_ctrl0_rosdac_q_bw0</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_gain_ctrl1</name>
						<description>rbb_gain_ctrl1.</description>
						<addressOffset>0x304</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl1_g_rbb1</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gain_ctrl1_g_rbb2</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>gain_ctrl1_rosdac_i_bw1</name>
								<lsb>18</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>gain_ctrl1_rosdac_q_bw1</name>
								<lsb>12</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>gain_ctrl1_rosdac_i_bw0</name>
								<lsb>6</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>gain_ctrl1_rosdac_q_bw0</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_gain_ctrl2</name>
						<description>rbb_gain_ctrl2.</description>
						<addressOffset>0x308</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl2_g_rbb1</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gain_ctrl2_g_rbb2</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>gain_ctrl2_rosdac_i_bw1</name>
								<lsb>18</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>gain_ctrl2_rosdac_q_bw1</name>
								<lsb>12</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>gain_ctrl2_rosdac_i_bw0</name>
								<lsb>6</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>gain_ctrl2_rosdac_q_bw0</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_gain_ctrl3</name>
						<description>rbb_gain_ctrl3.</description>
						<addressOffset>0x30C</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl3_g_rbb1</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gain_ctrl3_g_rbb2</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>gain_ctrl3_rosdac_i_bw1</name>
								<lsb>18</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>gain_ctrl3_rosdac_q_bw1</name>
								<lsb>12</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>gain_ctrl3_rosdac_i_bw0</name>
								<lsb>6</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>gain_ctrl3_rosdac_q_bw0</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_gain_ctrl4</name>
						<description>rbb_gain_ctrl4.</description>
						<addressOffset>0x310</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl4_g_rbb1</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gain_ctrl4_g_rbb2</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>gain_ctrl4_rosdac_i_bw1</name>
								<lsb>18</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>gain_ctrl4_rosdac_q_bw1</name>
								<lsb>12</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>gain_ctrl4_rosdac_i_bw0</name>
								<lsb>6</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>gain_ctrl4_rosdac_q_bw0</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_gain_ctrl5</name>
						<description>rbb_gain_ctrl5.</description>
						<addressOffset>0x314</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl5_g_rbb1</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gain_ctrl5_g_rbb2</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>gain_ctrl5_rosdac_i_bw1</name>
								<lsb>18</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>gain_ctrl5_rosdac_q_bw1</name>
								<lsb>12</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>gain_ctrl5_rosdac_i_bw0</name>
								<lsb>6</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>gain_ctrl5_rosdac_q_bw0</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_gain_ctrl6</name>
						<description>rbb_gain_ctrl6.</description>
						<addressOffset>0x318</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl6_g_rbb1</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gain_ctrl6_g_rbb2</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>gain_ctrl6_rosdac_i_bw1</name>
								<lsb>18</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>gain_ctrl6_rosdac_q_bw1</name>
								<lsb>12</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>gain_ctrl6_rosdac_i_bw0</name>
								<lsb>6</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>gain_ctrl6_rosdac_q_bw0</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_gain_ctrl7</name>
						<description>rbb_gain_ctrl7.</description>
						<addressOffset>0x31C</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl7_g_rbb1</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gain_ctrl7_g_rbb2</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>gain_ctrl7_rosdac_i_bw1</name>
								<lsb>18</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>gain_ctrl7_rosdac_q_bw1</name>
								<lsb>12</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>gain_ctrl7_rosdac_i_bw0</name>
								<lsb>6</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>gain_ctrl7_rosdac_q_bw0</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_gain_ctrl8</name>
						<description>rbb_gain_ctrl8.</description>
						<addressOffset>0x320</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl8_g_rbb1</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gain_ctrl8_g_rbb2</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>gain_ctrl8_rosdac_i_bw1</name>
								<lsb>18</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>gain_ctrl8_rosdac_q_bw1</name>
								<lsb>12</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>gain_ctrl8_rosdac_i_bw0</name>
								<lsb>6</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>gain_ctrl8_rosdac_q_bw0</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_gain_ctrl9</name>
						<description>rbb_gain_ctrl9.</description>
						<addressOffset>0x324</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl9_g_rbb1</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gain_ctrl9_g_rbb2</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>gain_ctrl9_rosdac_i_bw1</name>
								<lsb>18</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>gain_ctrl9_rosdac_q_bw1</name>
								<lsb>12</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>gain_ctrl9_rosdac_i_bw0</name>
								<lsb>6</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>gain_ctrl9_rosdac_q_bw0</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_gain_ctrl10</name>
						<description>rbb_gain_ctrl10.</description>
						<addressOffset>0x328</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl10_g_rbb1</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gain_ctrl10_g_rbb2</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>gain_ctrl10_rosdac_i_bw1</name>
								<lsb>18</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>gain_ctrl10_rosdac_q_bw1</name>
								<lsb>12</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>gain_ctrl10_rosdac_i_bw0</name>
								<lsb>6</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>gain_ctrl10_rosdac_q_bw0</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_gain_ctrl11</name>
						<description>rbb_gain_ctrl11.</description>
						<addressOffset>0x32C</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl11_g_rbb1</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gain_ctrl11_g_rbb2</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>gain_ctrl11_rosdac_i_bw1</name>
								<lsb>18</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>gain_ctrl11_rosdac_q_bw1</name>
								<lsb>12</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>gain_ctrl11_rosdac_i_bw0</name>
								<lsb>6</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>gain_ctrl11_rosdac_q_bw0</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_gain_ctrl12</name>
						<description>rbb_gain_ctrl12.</description>
						<addressOffset>0x330</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl12_g_rbb1</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gain_ctrl12_g_rbb2</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>gain_ctrl12_rosdac_i_bw1</name>
								<lsb>18</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>gain_ctrl12_rosdac_q_bw1</name>
								<lsb>12</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>gain_ctrl12_rosdac_i_bw0</name>
								<lsb>6</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>gain_ctrl12_rosdac_q_bw0</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_gain_ctrl13</name>
						<description>rbb_gain_ctrl13.</description>
						<addressOffset>0x334</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl13_g_rbb1</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gain_ctrl13_g_rbb2</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>gain_ctrl13_rosdac_i_bw1</name>
								<lsb>18</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>gain_ctrl13_rosdac_q_bw1</name>
								<lsb>12</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>gain_ctrl13_rosdac_i_bw0</name>
								<lsb>6</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>gain_ctrl13_rosdac_q_bw0</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_gain_ctrl14</name>
						<description>rbb_gain_ctrl14.</description>
						<addressOffset>0x338</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl14_g_rbb1</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gain_ctrl14_g_rbb2</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>gain_ctrl14_rosdac_i_bw1</name>
								<lsb>18</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>gain_ctrl14_rosdac_q_bw1</name>
								<lsb>12</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>gain_ctrl14_rosdac_i_bw0</name>
								<lsb>6</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>gain_ctrl14_rosdac_q_bw0</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_gain_ctrl15</name>
						<description>rbb_gain_ctrl15.</description>
						<addressOffset>0x33C</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl15_g_rbb1</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gain_ctrl15_g_rbb2</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>gain_ctrl15_rosdac_i_bw1</name>
								<lsb>18</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>gain_ctrl15_rosdac_q_bw1</name>
								<lsb>12</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>gain_ctrl15_rosdac_i_bw0</name>
								<lsb>6</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>gain_ctrl15_rosdac_q_bw0</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>acal_config</name>
						<description>acal_config.</description>
						<addressOffset>0x400</addressOffset>
						<fields>
							<field>
								<name>vco_idac_hh</name>
								<lsb>24</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>vco_idac_hl</name>
								<lsb>16</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>vco_idac_lh</name>
								<lsb>8</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>vco_idac_ll</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2402</name>
						<description>lo_config_2402.</description>
						<addressOffset>0x404</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2402</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2402</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2404</name>
						<description>lo_config_2404.</description>
						<addressOffset>0x408</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2404</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2404</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2406</name>
						<description>lo_config_2406.</description>
						<addressOffset>0x40C</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2406</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2406</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2408</name>
						<description>lo_config_2408.</description>
						<addressOffset>0x410</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2408</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2408</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2410</name>
						<description>lo_config_2410.</description>
						<addressOffset>0x414</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2410</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2410</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2412</name>
						<description>lo_config_2412.</description>
						<addressOffset>0x418</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2412</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2412</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2414</name>
						<description>lo_config_2414.</description>
						<addressOffset>0x41C</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2414</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2414</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2416</name>
						<description>lo_config_2416.</description>
						<addressOffset>0x420</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2416</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2416</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2418</name>
						<description>lo_config_2418.</description>
						<addressOffset>0x424</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2418</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2418</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2420</name>
						<description>lo_config_2420.</description>
						<addressOffset>0x428</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2420</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2420</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2422</name>
						<description>lo_config_2422.</description>
						<addressOffset>0x42C</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2422</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2422</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2424</name>
						<description>lo_config_2424.</description>
						<addressOffset>0x430</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2424</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2424</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
