andelf/bl702-pac/svd/bl702.svd
					<register>
						<name>lo_config_2426</name>
						<description>lo_config_2426.</description>
						<addressOffset>0x434</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2426</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2426</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2428</name>
						<description>lo_config_2428.</description>
						<addressOffset>0x438</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2428</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2428</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2430</name>
						<description>lo_config_2430.</description>
						<addressOffset>0x43C</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2430</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2430</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2432</name>
						<description>lo_config_2432.</description>
						<addressOffset>0x440</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2432</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2432</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2434</name>
						<description>lo_config_2434.</description>
						<addressOffset>0x444</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2434</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2434</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2436</name>
						<description>lo_config_2436.</description>
						<addressOffset>0x448</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2436</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2436</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2438</name>
						<description>lo_config_2438.</description>
						<addressOffset>0x44C</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2438</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2438</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2440</name>
						<description>lo_config_2440.</description>
						<addressOffset>0x450</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2440</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2440</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2442</name>
						<description>lo_config_2442.</description>
						<addressOffset>0x454</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2442</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2442</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2444</name>
						<description>lo_config_2444.</description>
						<addressOffset>0x458</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2444</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2444</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2446</name>
						<description>lo_config_2446.</description>
						<addressOffset>0x45C</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2446</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2446</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2448</name>
						<description>lo_config_2448.</description>
						<addressOffset>0x460</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2448</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2448</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2450</name>
						<description>lo_config_2450.</description>
						<addressOffset>0x464</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2450</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2450</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2452</name>
						<description>lo_config_2452.</description>
						<addressOffset>0x468</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2452</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2452</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2454</name>
						<description>lo_config_2454.</description>
						<addressOffset>0x46C</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2454</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2454</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2456</name>
						<description>lo_config_2456.</description>
						<addressOffset>0x470</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2456</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2456</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2458</name>
						<description>lo_config_2458.</description>
						<addressOffset>0x474</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2458</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2458</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2460</name>
						<description>lo_config_2460.</description>
						<addressOffset>0x478</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2460</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2460</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2462</name>
						<description>lo_config_2462.</description>
						<addressOffset>0x47C</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2462</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2462</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2464</name>
						<description>lo_config_2464.</description>
						<addressOffset>0x480</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2464</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2464</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2466</name>
						<description>lo_config_2466.</description>
						<addressOffset>0x484</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2466</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2466</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2468</name>
						<description>lo_config_2468.</description>
						<addressOffset>0x488</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2468</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2468</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2470</name>
						<description>lo_config_2470.</description>
						<addressOffset>0x48C</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2470</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2470</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2472</name>
						<description>lo_config_2472.</description>
						<addressOffset>0x490</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2472</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2472</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2474</name>
						<description>lo_config_2474.</description>
						<addressOffset>0x494</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2474</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2474</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2476</name>
						<description>lo_config_2476.</description>
						<addressOffset>0x498</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2476</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2476</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2478</name>
						<description>lo_config_2478.</description>
						<addressOffset>0x49C</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2478</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2478</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2480</name>
						<description>lo_config_2480.</description>
						<addressOffset>0x4A0</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2480</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2480</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2405</name>
						<description>lo_config_2405.</description>
						<addressOffset>0x4A4</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2405</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2405</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2415</name>
						<description>lo_config_2415.</description>
						<addressOffset>0x4A8</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2415</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2415</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2425</name>
						<description>lo_config_2425.</description>
						<addressOffset>0x4AC</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2425</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2425</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2435</name>
						<description>lo_config_2435.</description>
						<addressOffset>0x4B0</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2435</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2435</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2445</name>
						<description>lo_config_2445.</description>
						<addressOffset>0x4B4</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2445</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2445</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2455</name>
						<description>lo_config_2455.</description>
						<addressOffset>0x4B8</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2455</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2455</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2465</name>
						<description>lo_config_2465.</description>
						<addressOffset>0x4BC</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2465</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2465</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_config_2475</name>
						<description>lo_config_2475.</description>
						<addressOffset>0x4C0</addressOffset>
						<fields>
							<field>
								<name>adpll_sdm_dither_en_2475</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>kcal_ratio_2475</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dg_testbus_0</name>
						<description>dg_testbus_0.</description>
						<addressOffset>0x500</addressOffset>
						<fields>
							<field>
								<name>rf_testbus_read</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dg_testbus_1</name>
						<description>dg_testbus_1.</description>
						<addressOffset>0x504</addressOffset>
						<fields>
							<field>
								<name>rf_testbus_sel</name>
								<lsb>0</lsb>
								<msb>3</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dg_ppud_0</name>
						<description>dg_ppud_0.</description>
						<addressOffset>0x508</addressOffset>
						<fields>
							<field>
								<name>ppud_manaual_en</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>ppud_cnt1</name>
								<lsb>25</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>ppud_cnt2</name>
								<lsb>16</lsb>
								<msb>24</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_top</name>
						<description>rf_top.</description>
						<addressOffset>0x50C</addressOffset>
						<fields>
							<field>
								<name>rf_tx_en_src</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>rf_tx_en_4s</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>rf_rx_en_src</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>rf_rx_en_4s</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>rf_rx_mode_4s_en</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>rf_rx_mode_4s</name>
								<lsb>24</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>rf_rx_mode_hw</name>
								<lsb>22</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>rf_mac_lo_time_offset</name>
								<lsb>16</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>rfckg_afifo_tx_inv</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>rfckg_afifo_rxadc_inv</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>rfckg_afifo_adpll_inv</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_fsm</name>
						<description>rf_fsm.</description>
						<addressOffset>0x510</addressOffset>
						<fields>
							<field>
								<name>rf_fsm_afifo_dly_time</name>
								<lsb>26</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>rf_fsm_tx_afifo_4s_en</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>rf_fsm_tx_afifo_4s</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>rf_fsm_rx_afifo_4s_en</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>rf_fsm_rx_afifo_4s</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>rf_fsm_en</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>rf_fsm_st_4s_en</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>rf_fsm_st_4s</name>
								<lsb>16</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>rf_fsm_state</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>rf_fsm_lo_time</name>
								<lsb>0</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_singen_0</name>
						<description>rf_singen_0.</description>
						<addressOffset>0x514</addressOffset>
						<fields>
							<field>
								<name>singen_en</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>singen_clkdiv_n</name>
								<lsb>29</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>singen_unsign_en</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>singen_inc_step0</name>
								<lsb>16</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>singen_inc_step1</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_singen_1</name>
						<description>rf_singen_1.</description>
						<addressOffset>0x518</addressOffset>
						<fields>
							<field>
								<name>singen_mode_i</name>
								<lsb>28</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>singen_clkdiv_i</name>
								<lsb>16</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>singen_mode_q</name>
								<lsb>12</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>singen_clkdiv_q</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_singen_2</name>
						<description>rf_singen_2.</description>
						<addressOffset>0x51C</addressOffset>
						<fields>
							<field>
								<name>singen_start_addr0_i</name>
								<lsb>22</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>singen_start_addr1_i</name>
								<lsb>12</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>singen_gain_i</name>
								<lsb>0</lsb>
								<msb>10</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_singen_3</name>
						<description>rf_singen_3.</description>
						<addressOffset>0x520</addressOffset>
						<fields>
							<field>
								<name>singen_start_addr0_q</name>
								<lsb>22</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>singen_start_addr1_q</name>
								<lsb>12</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>singen_gain_q</name>
								<lsb>0</lsb>
								<msb>10</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_singen_4</name>
						<description>rf_singen_4.</description>
						<addressOffset>0x524</addressOffset>
						<fields>
							<field>
								<name>singen_fix_en_i</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>singen_fix_i</name>
								<lsb>16</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>singen_fix_en_q</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>singen_fix_q</name>
								<lsb>0</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_sram_ctrl0</name>
						<description>rf_sram_ctrl0.</description>
						<addressOffset>0x528</addressOffset>
						<fields>
							<field>
								<name>rf_sram_done_cnt</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>rf_sram_mode</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>rf_sram_sts_clr</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>rf_sram_loop_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>rf_sram_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>rf_sram_done</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_sram_ctrl1</name>
						<description>rf_sram_ctrl1.</description>
						<addressOffset>0x52C</addressOffset>
						<fields>
							<field>
								<name>rf_sram_addr_start</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>rf_sram_addr_end</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_sram_ctrl2</name>
						<description>rf_sram_ctrl2.</description>
						<addressOffset>0x530</addressOffset>
						<fields>
							<field>
								<name>rf_sram_sts</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
