andelf/bl702-pac/svd/bl702.svd
					<register>
						<name>rf_test_mode</name>
						<description>rf_test_mode.</description>
						<addressOffset>0x534</addressOffset>
						<fields>
							<field>
								<name>rf_test_mode_en</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>dacout_4s_sram_en</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>dacout_4s_en</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>dacout_4s</name>
								<lsb>16</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>dacout_hw</name>
								<lsb>0</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_rx_pulse_filter</name>
						<description>rf_rx_pulse_filter.</description>
						<addressOffset>0x538</addressOffset>
						<fields>
							<field>
								<name>pf_en_i</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>pf_en_q</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>pf_th1</name>
								<lsb>10</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>pf_th2</name>
								<lsb>0</lsb>
								<msb>8</msb>
							</field>
						</fields>
					</register>
				</registers>
			</peripheral>
			<peripheral>
				<name>gpip</name>
				<description>gpip.</description>
				<baseAddress>0x40002000</baseAddress>
				<groupName>gpip</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>gpadc_config</name>
						<description>gpadc_config.</description>
						<addressOffset>0x0</addressOffset>
						<fields>
							<field>
								<name>rsvd_31_24</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>gpadc_fifo_thl</name>
								<lsb>22</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>gpadc_fifo_data_count</name>
								<lsb>16</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>gpadc_fifo_rdy_mask</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>gpadc_fifo_underrun_mask</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>gpadc_fifo_overrun_mask</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>gpadc_rdy_mask</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>gpadc_fifo_underrun_clr</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>gpadc_fifo_overrun_clr</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>gpadc_rdy_clr</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>gpadc_fifo_rdy</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>gpadc_fifo_underrun</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>gpadc_fifo_overrun</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>gpadc_rdy</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>gpadc_fifo_full</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>gpadc_fifo_ne</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>gpadc_fifo_clr</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>gpadc_dma_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpadc_dma_rdata</name>
						<description>gpadc_dma_rdata.</description>
						<addressOffset>0x4</addressOffset>
						<fields>
							<field>
								<name>rsvd_31_26</name>
								<lsb>26</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>gpadc_dma_rdata</name>
								<lsb>0</lsb>
								<msb>25</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpdac_config</name>
						<description>gpdac_config.</description>
						<addressOffset>0x40</addressOffset>
						<fields>
							<field>
								<name>rsvd_31_24</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>gpdac_ch_b_sel</name>
								<lsb>20</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>gpdac_ch_a_sel</name>
								<lsb>16</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>gpdac_mode</name>
								<lsb>8</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>dsm_mode</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>gpdac_en2</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>gpdac_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpdac_dma_config</name>
						<description>gpdac_dma_config.</description>
						<addressOffset>0x44</addressOffset>
						<fields>
							<field>
								<name>gpdac_dma_format</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>gpdac_dma_tx_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpdac_dma_wdata</name>
						<description>gpdac_dma_wdata.</description>
						<addressOffset>0x48</addressOffset>
						<fields>
							<field>
								<name>gpdac_dma_wdata</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpdac_tx_fifo_status</name>
						<description>gpdac_tx_fifo_status.</description>
						<addressOffset>0x4C</addressOffset>
						<fields>
							<field>
								<name>TxFifoWrPtr</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>TxFifoRdPtr</name>
								<lsb>4</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>tx_cs</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>tx_fifo_full</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>tx_fifo_empty</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
