andelf/bl702-pac/svd/bl702.svd
				</registers>
			</peripheral>
			<peripheral>
				<name>ef_data_1</name>
				<description>ef_data_1.</description>
				<baseAddress>0x40007000</baseAddress>
				<groupName>ef_data_1</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>reg_key_slot_6_w0</name>
						<description>reg_key_slot_6_w0.</description>
						<addressOffset>0x80</addressOffset>
						<fields>
							<field>
								<name>reg_key_slot_6_w0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_6_w1</name>
						<description>reg_key_slot_6_w1.</description>
						<addressOffset>0x84</addressOffset>
						<fields>
							<field>
								<name>reg_key_slot_6_w1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_6_w2</name>
						<description>reg_key_slot_6_w2.</description>
						<addressOffset>0x88</addressOffset>
						<fields>
							<field>
								<name>reg_key_slot_6_w2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_6_w3</name>
						<description>reg_key_slot_6_w3.</description>
						<addressOffset>0x8C</addressOffset>
						<fields>
							<field>
								<name>reg_key_slot_6_w3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_7_w0</name>
						<description>reg_key_slot_7_w0.</description>
						<addressOffset>0x90</addressOffset>
						<fields>
							<field>
								<name>reg_key_slot_7_w0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_7_w1</name>
						<description>reg_key_slot_7_w1.</description>
						<addressOffset>0x94</addressOffset>
						<fields>
							<field>
								<name>reg_key_slot_7_w1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_7_w2</name>
						<description>reg_key_slot_7_w2.</description>
						<addressOffset>0x98</addressOffset>
						<fields>
							<field>
								<name>reg_key_slot_7_w2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_7_w3</name>
						<description>reg_key_slot_7_w3.</description>
						<addressOffset>0x9C</addressOffset>
						<fields>
							<field>
								<name>reg_key_slot_7_w3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_8_w0</name>
						<description>reg_key_slot_8_w0.</description>
						<addressOffset>0xA0</addressOffset>
						<fields>
							<field>
								<name>reg_key_slot_8_w0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_8_w1</name>
						<description>reg_key_slot_8_w1.</description>
						<addressOffset>0xA4</addressOffset>
						<fields>
							<field>
								<name>reg_key_slot_8_w1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_8_w2</name>
						<description>reg_key_slot_8_w2.</description>
						<addressOffset>0xA8</addressOffset>
						<fields>
							<field>
								<name>reg_key_slot_8_w2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_8_w3</name>
						<description>reg_key_slot_8_w3.</description>
						<addressOffset>0xAC</addressOffset>
						<fields>
							<field>
								<name>reg_key_slot_8_w3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_9_w0</name>
						<description>reg_key_slot_9_w0.</description>
						<addressOffset>0xB0</addressOffset>
						<fields>
							<field>
								<name>reg_key_slot_9_w0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_9_w1</name>
						<description>reg_key_slot_9_w1.</description>
						<addressOffset>0xB4</addressOffset>
						<fields>
							<field>
								<name>reg_key_slot_9_w1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_9_w2</name>
						<description>reg_key_slot_9_w2.</description>
						<addressOffset>0xB8</addressOffset>
						<fields>
							<field>
								<name>reg_key_slot_9_w2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_9_w3</name>
						<description>reg_key_slot_9_w3.</description>
						<addressOffset>0xBC</addressOffset>
						<fields>
							<field>
								<name>reg_key_slot_9_w3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>reg_key_slot_10_w0</name>
						<description>reg_key_slot_10_w0.</description>
						<addressOffset>0xC0</addressOffset>
						<fields/>
					</register>
					<register>
						<name>reg_key_slot_10_w1</name>
						<description>reg_key_slot_10_w1.</description>
						<addressOffset>0xC4</addressOffset>
						<fields/>
					</register>
					<register>
						<name>reg_key_slot_10_w2</name>
						<description>reg_key_slot_10_w2.</description>
						<addressOffset>0xC8</addressOffset>
						<fields/>
					</register>
					<register>
						<name>reg_key_slot_10_w3</name>
						<description>reg_key_slot_10_w3.</description>
						<addressOffset>0xCC</addressOffset>
						<fields/>
					</register>
					<register>
						<name>reg_key_slot_11_w0</name>
						<description>reg_key_slot_11_w0.</description>
						<addressOffset>0xD0</addressOffset>
						<fields/>
					</register>
					<register>
						<name>reg_key_slot_11_w1</name>
						<description>reg_key_slot_11_w1.</description>
						<addressOffset>0xD4</addressOffset>
						<fields/>
					</register>
					<register>
						<name>reg_key_slot_11_w2</name>
						<description>reg_key_slot_11_w2.</description>
						<addressOffset>0xD8</addressOffset>
						<fields/>
					</register>
					<register>
						<name>reg_key_slot_11_w3</name>
						<description>reg_key_slot_11_w3.</description>
						<addressOffset>0xDC</addressOffset>
						<fields/>
					</register>
					<register>
						<name>reg_data_1_lock</name>
						<description>reg_data_1_lock.</description>
						<addressOffset>0xE0</addressOffset>
						<fields>
							<field>
								<name>rd_lock_key_slot_9</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>rd_lock_key_slot_8</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>rd_lock_key_slot_7</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>rd_lock_key_slot_6</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>RESERVED_25_16</name>
								<lsb>16</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>wr_lock_key_slot_9</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>wr_lock_key_slot_8</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>wr_lock_key_slot_7</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>wr_lock_key_slot_6</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>RESERVED_9_0</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
