andelf/bl702-pac/svd/bl702.svd
				</registers>
			</peripheral>
			<peripheral>
				<name>cks</name>
				<description>cks.</description>
				<baseAddress>0x4000A700</baseAddress>
				<groupName>cks</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>cks_config</name>
						<description>cks_config.</description>
						<addressOffset>0x0</addressOffset>
						<fields>
							<field>
								<name>cr_cks_byte_swap</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>cr_cks_clr</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>data_in</name>
						<description>data_in.</description>
						<addressOffset>0x4</addressOffset>
						<fields>
							<field>
								<name>data_in</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>cks_out</name>
						<description>cks_out.</description>
						<addressOffset>0x8</addressOffset>
						<fields>
							<field>
								<name>cks_out</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
				</registers>
			</peripheral>
			<peripheral>
				<name>qdec</name>
				<description>qdec.</description>
				<baseAddress>0x4000A800</baseAddress>
				<groupName>qdec</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>qdec_ctrl</name>
						<description>qdec_ctrl.</description>
						<addressOffset>0x0</addressOffset>
						<fields>
							<field>
								<name>input_swap</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>rpt_mode</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>spl_mode</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>led_period</name>
								<lsb>20</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>rpt_period</name>
								<lsb>12</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>spl_period</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>deg_cnt</name>
								<lsb>4</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>deg_en</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>led_pol</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>led_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>qdec_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>qdec_value</name>
						<description>qdec_value.</description>
						<addressOffset>0x4</addressOffset>
						<fields>
							<field>
								<name>spl_val</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>acc2_val</name>
								<lsb>16</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>acc1_val</name>
								<lsb>0</lsb>
								<msb>10</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>qdec_int_en</name>
						<description>qdec_int_en.</description>
						<addressOffset>0x10</addressOffset>
						<fields>
							<field>
								<name>overflow_en</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>dbl_rdy_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>spl_rdy_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>rpt_rdy_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>qdec_int_sts</name>
						<description>qdec_int_sts.</description>
						<addressOffset>0x14</addressOffset>
						<fields>
							<field>
								<name>overflow_sts</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>dbl_rdy_sts</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>spl_rdy_sts</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>rpt_rdy_sts</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>qdec_int_clr</name>
						<description>qdec_int_clr.</description>
						<addressOffset>0x18</addressOffset>
						<fields>
							<field>
								<name>overflow_clr</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>dbl_rdy_clr</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>spl_rdy_clr</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>rpt_rdy_clr</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
				</registers>
			</peripheral>
			<peripheral>
				<name>kys</name>
				<description>kys.</description>
				<baseAddress>0x4000AB00</baseAddress>
				<groupName>kys</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>ks_ctrl</name>
						<description>ks_ctrl.</description>
						<addressOffset>0x0</addressOffset>
						<fields>
							<field>
								<name>col_num</name>
								<lsb>20</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>row_num</name>
								<lsb>16</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>rc_ext</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>deg_cnt</name>
								<lsb>4</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>deg_en</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>ghost_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>ks_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ks_int_en</name>
						<description>ks_int_en.</description>
						<addressOffset>0x10</addressOffset>
						<fields>
							<field>
								<name>ks_int_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ks_int_sts</name>
						<description>ks_int_sts.</description>
						<addressOffset>0x14</addressOffset>
						<fields>
							<field>
								<name>keycode_valid</name>
								<lsb>0</lsb>
								<msb>3</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>keycode_clr</name>
						<description>keycode_clr.</description>
						<addressOffset>0x18</addressOffset>
						<fields>
							<field>
								<name>keycode_clr</name>
								<lsb>0</lsb>
								<msb>3</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>keycode_value</name>
						<description>keycode_value.</description>
						<addressOffset>0x1C</addressOffset>
						<fields>
							<field>
								<name>keycode3</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>keycode2</name>
								<lsb>16</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>keycode1</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>keycode0</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
