andelf/bl702-pac/svd/bl702.svd
				</registers>
			</peripheral>
			<peripheral>
				<name>cam</name>
				<description>cam.</description>
				<baseAddress>0x4000AD00</baseAddress>
				<groupName>cam</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>dvp2axi_configue</name>
						<description>dvp2axi_configue.</description>
						<addressOffset>0x0</addressOffset>
						<fields>
							<field>
								<name>reg_dvp_wait_cycle</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>reg_dvp_pix_clk_cg</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_interlv_mode</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_subsample_even</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>reg_subsample_en</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>reg_drop_even</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>reg_drop_en</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>reg_hw_mode_fwrap</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>reg_dvp_mode</name>
								<lsb>8</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>reg_hburst</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_line_vld_pol</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_fram_vld_pol</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>reg_sw_mode</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_dvp_enable</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dvp2ahb_addr_start_0</name>
						<description>dvp2ahb_addr_start_0.</description>
						<addressOffset>0x4</addressOffset>
						<fields>
							<field>
								<name>reg_addr_start_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dvp2ahb_mem_bcnt_0</name>
						<description>dvp2ahb_mem_bcnt_0.</description>
						<addressOffset>0x8</addressOffset>
						<fields>
							<field>
								<name>reg_mem_burst_cnt_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dvp2ahb_frame_bcnt_0</name>
						<description>dvp2ahb_frame_bcnt_0.</description>
						<addressOffset>0xC</addressOffset>
						<fields>
							<field>
								<name>reg_frame_burst_cnt_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dvp2ahb_addr_start_1</name>
						<description>dvp2ahb_addr_start_1.</description>
						<addressOffset>0x10</addressOffset>
						<fields>
							<field>
								<name>reg_addr_start_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dvp2ahb_mem_bcnt_1</name>
						<description>dvp2ahb_mem_bcnt_1.</description>
						<addressOffset>0x14</addressOffset>
						<fields>
							<field>
								<name>reg_mem_burst_cnt_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dvp2ahb_frame_bcnt_1</name>
						<description>dvp2ahb_frame_bcnt_1.</description>
						<addressOffset>0x18</addressOffset>
						<fields>
							<field>
								<name>reg_frame_burst_cnt_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dvp_status_and_error</name>
						<description>dvp_status_and_error.</description>
						<addressOffset>0x1C</addressOffset>
						<fields>
							<field>
								<name>st_bus_flsh</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>st_bus_wait</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>st_bus_func</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>st_bus_idle</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>frame_valid_cnt_1</name>
								<lsb>24</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>frame_valid_cnt_0</name>
								<lsb>20</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>st_dvp_idle</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>ahb_idle_1</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>ahb_idle_0</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>sts_vcnt_int</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>sts_hcnt_int</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>sts_fifo_int_1</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>sts_fifo_int_0</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>sts_frame_int_1</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>sts_frame_int_0</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>sts_mem_int_1</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>sts_mem_int_0</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>sts_normal_int_1</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>sts_normal_int_0</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dvp_frame_fifo_pop</name>
						<description>dvp_frame_fifo_pop.</description>
						<addressOffset>0x20</addressOffset>
						<fields>
							<field>
								<name>reg_int_fifo_clr_1</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_int_frame_clr_1</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>reg_int_mem_clr_1</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_int_normal_clr_1</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_int_vcnt_clr_0</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>reg_int_hcnt_clr_0</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>reg_int_fifo_clr_0</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>reg_int_frame_clr_0</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>reg_int_mem_clr_0</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_int_normal_clr_0</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>rfifo_pop_1</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>rfifo_pop_0</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>snsr_control</name>
						<description>snsr_control.</description>
						<addressOffset>0x24</addressOffset>
						<fields>
							<field>
								<name>reg_cam_pwdn</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_cam_rst</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>int_control</name>
						<description>int_control.</description>
						<addressOffset>0x28</addressOffset>
						<fields>
							<field>
								<name>reg_frame_cnt_trgr_int</name>
								<lsb>28</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>reg_int_vcnt_en</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>reg_int_hcnt_en</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_int_fifo_en</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_int_frame_en</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_int_mem_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>reg_int_normal_1_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_int_normal_0_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>hsync_control</name>
						<description>hsync_control.</description>
						<addressOffset>0x30</addressOffset>
						<fields>
							<field>
								<name>reg_hsync_act_start</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>reg_hsync_act_end</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>vsync_control</name>
						<description>vsync_control.</description>
						<addressOffset>0x34</addressOffset>
						<fields>
							<field>
								<name>reg_vsync_act_start</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>reg_vsync_act_end</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_size_control</name>
						<description>frame_size_control.</description>
						<addressOffset>0x38</addressOffset>
						<fields>
							<field>
								<name>reg_total_vcnt</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>reg_total_hcnt</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_start_addr0_0</name>
						<description>frame_start_addr0_0.</description>
						<addressOffset>0x40</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_0_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_byte_cnt0_0</name>
						<description>frame_byte_cnt0_0.</description>
						<addressOffset>0x44</addressOffset>
						<fields>
							<field>
								<name>frame_byte_cnt_0_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_start_addr0_1</name>
						<description>frame_start_addr0_1.</description>
						<addressOffset>0x48</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_0_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_byte_cnt0_1</name>
						<description>frame_byte_cnt0_1.</description>
						<addressOffset>0x4C</addressOffset>
						<fields>
							<field>
								<name>frame_byte_cnt_0_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_start_addr0_2</name>
						<description>frame_start_addr0_2.</description>
						<addressOffset>0x50</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_0_2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_byte_cnt0_2</name>
						<description>frame_byte_cnt0_2.</description>
						<addressOffset>0x54</addressOffset>
						<fields>
							<field>
								<name>frame_byte_cnt_0_2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_start_addr0_3</name>
						<description>frame_start_addr0_3.</description>
						<addressOffset>0x58</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_0_3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_byte_cnt0_3</name>
						<description>frame_byte_cnt0_3.</description>
						<addressOffset>0x5C</addressOffset>
						<fields>
							<field>
								<name>frame_byte_cnt_0_3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_start_addr0_4</name>
						<description>frame_start_addr0_4.</description>
						<addressOffset>0x60</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_0_4</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_byte_cnt0_4</name>
						<description>frame_byte_cnt0_4.</description>
						<addressOffset>0x64</addressOffset>
						<fields>
							<field>
								<name>frame_byte_cnt_0_4</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_start_addr0_5</name>
						<description>frame_start_addr0_5.</description>
						<addressOffset>0x68</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_0_5</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_byte_cnt0_5</name>
						<description>frame_byte_cnt0_5.</description>
						<addressOffset>0x6C</addressOffset>
						<fields>
							<field>
								<name>frame_byte_cnt_0_5</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_start_addr0_6</name>
						<description>frame_start_addr0_6.</description>
						<addressOffset>0x70</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_0_6</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_byte_cnt0_6</name>
						<description>frame_byte_cnt0_6.</description>
						<addressOffset>0x74</addressOffset>
						<fields>
							<field>
								<name>frame_byte_cnt_0_6</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_start_addr0_7</name>
						<description>frame_start_addr0_7.</description>
						<addressOffset>0x78</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_0_7</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_byte_cnt0_7</name>
						<description>frame_byte_cnt0_7.</description>
						<addressOffset>0x7C</addressOffset>
						<fields>
							<field>
								<name>frame_byte_cnt_0_7</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_start_addr1_0</name>
						<description>frame_start_addr1_0.</description>
						<addressOffset>0x80</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_1_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_byte_cnt1_0</name>
						<description>frame_byte_cnt1_0.</description>
						<addressOffset>0x84</addressOffset>
						<fields>
							<field>
								<name>frame_byte_cnt_1_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_start_addr1_1</name>
						<description>frame_start_addr1_1.</description>
						<addressOffset>0x88</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_1_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_byte_cnt1_1</name>
						<description>frame_byte_cnt1_1.</description>
						<addressOffset>0x8C</addressOffset>
						<fields>
							<field>
								<name>frame_byte_cnt_1_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_start_addr1_2</name>
						<description>frame_start_addr1_2.</description>
						<addressOffset>0x90</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_1_2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_byte_cnt1_2</name>
						<description>frame_byte_cnt1_2.</description>
						<addressOffset>0x94</addressOffset>
						<fields>
							<field>
								<name>frame_byte_cnt_1_2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_start_addr1_3</name>
						<description>frame_start_addr1_3.</description>
						<addressOffset>0x98</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_1_3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_byte_cnt1_3</name>
						<description>frame_byte_cnt1_3.</description>
						<addressOffset>0x9C</addressOffset>
						<fields>
							<field>
								<name>frame_byte_cnt_1_3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_start_addr1_4</name>
						<description>frame_start_addr1_4.</description>
						<addressOffset>0xA0</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_1_4</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_byte_cnt1_4</name>
						<description>frame_byte_cnt1_4.</description>
						<addressOffset>0xA4</addressOffset>
						<fields>
							<field>
								<name>frame_byte_cnt_1_4</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_start_addr1_5</name>
						<description>frame_start_addr1_5.</description>
						<addressOffset>0xA8</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_1_5</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_byte_cnt1_5</name>
						<description>frame_byte_cnt1_5.</description>
						<addressOffset>0xAC</addressOffset>
						<fields>
							<field>
								<name>frame_byte_cnt_1_5</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_start_addr1_6</name>
						<description>frame_start_addr1_6.</description>
						<addressOffset>0xB0</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_1_6</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_byte_cnt1_6</name>
						<description>frame_byte_cnt1_6.</description>
						<addressOffset>0xB4</addressOffset>
						<fields>
							<field>
								<name>frame_byte_cnt_1_6</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_start_addr1_7</name>
						<description>frame_start_addr1_7.</description>
						<addressOffset>0xB8</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_1_7</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>frame_byte_cnt1_7</name>
						<description>frame_byte_cnt1_7.</description>
						<addressOffset>0xBC</addressOffset>
						<fields>
							<field>
								<name>frame_byte_cnt_1_7</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dvp_debug</name>
						<description>dvp_debug.</description>
						<addressOffset>0xFF0</addressOffset>
						<fields>
							<field>
								<name>reg_dvp_dbg_sel</name>
								<lsb>1</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_dvp_dbg_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dvp_dummy_reg</name>
						<description>dvp_dummy_reg.</description>
						<addressOffset>0xFFC</addressOffset>
						<fields>
							<field>
								<name>RESERVED_31_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
