andelf/bl702-pac/svd/bl702.svd
				</registers>
			</peripheral>
			<peripheral>
				<name>mjpeg</name>
				<description>mjpeg.</description>
				<baseAddress>0x4000AE00</baseAddress>
				<groupName>mjpeg</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>mjpeg_control_1</name>
						<description>mjpeg_control_1.</description>
						<addressOffset>0x0</addressOffset>
						<fields>
							<field>
								<name>reg_v0_order</name>
								<lsb>30</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>reg_y1_order</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>reg_u0_order</name>
								<lsb>26</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>reg_y0_order</name>
								<lsb>24</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>reg_q_mode</name>
								<lsb>16</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>reg_yuv_mode</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>reg_h_bust</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>reg_reflect_dmy</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>reg_last_hf_hblk_dmy</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_last_hf_wblk_dmy</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_wr_over_stop</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_order_u_even</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>reg_mjpeg_bit_order</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_mjpeg_enable</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_control_2</name>
						<description>mjpeg_control_2.</description>
						<addressOffset>0x4</addressOffset>
						<fields>
							<field>
								<name>reg_mjpeg_wait_cycle</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>reg_uv_dvp2ahb_fsel</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>reg_uv_dvp2ahb_lsel</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>reg_yy_dvp2ahb_fsel</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>reg_yy_dvp2ahb_lsel</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>reg_mjpeg_sw_run</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>reg_mjpeg_sw_mode</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>reg_sw_frame</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_yy_frame_addr</name>
						<description>mjpeg_yy_frame_addr.</description>
						<addressOffset>0x08</addressOffset>
						<fields>
							<field>
								<name>reg_yy_addr_start</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_uv_frame_addr</name>
						<description>mjpeg_uv_frame_addr.</description>
						<addressOffset>0x0C</addressOffset>
						<fields>
							<field>
								<name>reg_uv_addr_start</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_yuv_mem</name>
						<description>mjpeg_yuv_mem.</description>
						<addressOffset>0x10</addressOffset>
						<fields>
							<field>
								<name>reg_uv_mem_hblk</name>
								<lsb>16</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>reg_yy_mem_hblk</name>
								<lsb>0</lsb>
								<msb>12</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>jpeg_frame_addr</name>
						<description>jpeg_frame_addr.</description>
						<addressOffset>0x14</addressOffset>
						<fields>
							<field>
								<name>reg_w_addr_start</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>jpeg_store_memory</name>
						<description>jpeg_store_memory.</description>
						<addressOffset>0x18</addressOffset>
						<fields>
							<field>
								<name>reg_w_burst_cnt</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_control_3</name>
						<description>mjpeg_control_3.</description>
						<addressOffset>0x1C</addressOffset>
						<fields>
							<field>
								<name>sts_swap_int</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>reg_int_swap_en</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>frame_valid_cnt</name>
								<lsb>24</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>sts_idle_int</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>reg_int_idle_en</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_frame_cnt_trgr_int</name>
								<lsb>16</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>ahb_idle</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>mjpeg_manf</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>mjpeg_mans</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>mjpeg_flsh</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>mjpeg_wait</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>mjpeg_func</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>mjpeg_idle</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>sts_frame_int</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>sts_mem_int</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>sts_cam_int</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>sts_normal_int</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_int_frame_en</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_int_mem_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>reg_int_cam_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_int_normal_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_frame_fifo_pop</name>
						<description>mjpeg_frame_fifo_pop.</description>
						<addressOffset>0x20</addressOffset>
						<fields>
							<field>
								<name>reg_int_swap_clr</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>reg_int_idle_clr</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>reg_int_frame_clr</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>reg_int_mem_clr</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>reg_int_cam_clr</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>reg_int_normal_clr</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>reg_w_swap_clr</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>rfifo_pop</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_frame_size</name>
						<description>mjpeg_frame_size.</description>
						<addressOffset>0x24</addressOffset>
						<fields>
							<field>
								<name>reg_frame_hblk</name>
								<lsb>16</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>reg_frame_wblk</name>
								<lsb>0</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_header_byte</name>
						<description>mjpeg_header_byte.</description>
						<addressOffset>0x28</addressOffset>
						<fields>
							<field>
								<name>reg_tail_exp</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_head_byte</name>
								<lsb>0</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_swap_mode</name>
						<description>mjpeg_swap_mode.</description>
						<addressOffset>0x30</addressOffset>
						<fields>
							<field>
								<name>sts_swap_fend</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>sts_swap_fstart</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>sts_read_swap_idx</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>sts_swap1_full</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>sts_swap0_full</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>reg_w_swap_mode</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_swap_bit_cnt</name>
						<description>mjpeg_swap_bit_cnt.</description>
						<addressOffset>0x34</addressOffset>
						<fields>
							<field>
								<name>frame_swap_end_bit_cnt</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_paket_ctrl</name>
						<description>mjpeg_paket_ctrl.</description>
						<addressOffset>0x38</addressOffset>
						<fields>
							<field>
								<name>reg_pket_body_byte</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>reg_jend_to_pend</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_pket_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_paket_head_tail</name>
						<description>mjpeg_paket_head_tail.</description>
						<addressOffset>0x3C</addressOffset>
						<fields>
							<field>
								<name>reg_pket_tail_byte</name>
								<lsb>16</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>reg_pket_head_byte</name>
								<lsb>0</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_Y_frame_read_status_1</name>
						<description>mjpeg_Y_frame_read_status_1.</description>
						<addressOffset>0x40</addressOffset>
						<fields>
							<field>
								<name>yy_frm_hblk_r</name>
								<lsb>16</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>yy_mem_hblk_r</name>
								<lsb>0</lsb>
								<msb>12</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_Y_frame_read_status_2</name>
						<description>mjpeg_Y_frame_read_status_2.</description>
						<addressOffset>0x44</addressOffset>
						<fields>
							<field>
								<name>yy_frm_cnt_r</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>yy_mem_rnd_r</name>
								<lsb>16</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>yy_wblk_r</name>
								<lsb>0</lsb>
								<msb>12</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_Y_frame_write_status</name>
						<description>mjpeg_Y_frame_write_status.</description>
						<addressOffset>0x48</addressOffset>
						<fields>
							<field>
								<name>yy_frm_cnt_w</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>yy_mem_rnd_w</name>
								<lsb>16</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>yy_mem_hblk_w</name>
								<lsb>0</lsb>
								<msb>12</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_UV_frame_read_status_1</name>
						<description>mjpeg_UV_frame_read_status_1.</description>
						<addressOffset>0x4C</addressOffset>
						<fields>
							<field>
								<name>uv_frm_hblk_r</name>
								<lsb>16</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>uv_mem_hblk_r</name>
								<lsb>0</lsb>
								<msb>12</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_UV_frame_read_status_2</name>
						<description>mjpeg_UV_frame_read_status_2.</description>
						<addressOffset>0x50</addressOffset>
						<fields>
							<field>
								<name>uv_frm_cnt_r</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>uv_mem_rnd_r</name>
								<lsb>16</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>uv_wblk_r</name>
								<lsb>0</lsb>
								<msb>12</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_UV_frame_write_status</name>
						<description>mjpeg_UV_frame_write_status.</description>
						<addressOffset>0x54</addressOffset>
						<fields>
							<field>
								<name>uv_frm_cnt_w</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>uv_mem_rnd_w</name>
								<lsb>16</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>uv_mem_hblk_w</name>
								<lsb>0</lsb>
								<msb>12</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_start_addr0</name>
						<description>mjpeg_start_addr0.</description>
						<addressOffset>0x80</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_bit_cnt0</name>
						<description>mjpeg_bit_cnt0.</description>
						<addressOffset>0x84</addressOffset>
						<fields>
							<field>
								<name>frame_bit_cnt_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_start_addr1</name>
						<description>mjpeg_start_addr1.</description>
						<addressOffset>0x88</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_bit_cnt1</name>
						<description>mjpeg_bit_cnt1.</description>
						<addressOffset>0x8C</addressOffset>
						<fields>
							<field>
								<name>frame_bit_cnt_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_start_addr2</name>
						<description>mjpeg_start_addr2.</description>
						<addressOffset>0x90</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_bit_cnt2</name>
						<description>mjpeg_bit_cnt2.</description>
						<addressOffset>0x94</addressOffset>
						<fields>
							<field>
								<name>frame_bit_cnt_2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_start_addr3</name>
						<description>mjpeg_start_addr3.</description>
						<addressOffset>0x98</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_bit_cnt3</name>
						<description>mjpeg_bit_cnt3.</description>
						<addressOffset>0x9C</addressOffset>
						<fields>
							<field>
								<name>frame_bit_cnt_3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_start_addr4</name>
						<description>mjpeg_start_addr4.</description>
						<addressOffset>0xA0</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_4</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_bit_cnt4</name>
						<description>mjpeg_bit_cnt4.</description>
						<addressOffset>0xA4</addressOffset>
						<fields>
							<field>
								<name>frame_bit_cnt_4</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_start_addr5</name>
						<description>mjpeg_start_addr5.</description>
						<addressOffset>0xA8</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_5</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_bit_cnt5</name>
						<description>mjpeg_bit_cnt5.</description>
						<addressOffset>0xAC</addressOffset>
						<fields>
							<field>
								<name>frame_bit_cnt_5</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_start_addr6</name>
						<description>mjpeg_start_addr6.</description>
						<addressOffset>0xB0</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_6</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_bit_cnt6</name>
						<description>mjpeg_bit_cnt6.</description>
						<addressOffset>0xB4</addressOffset>
						<fields>
							<field>
								<name>frame_bit_cnt_6</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_start_addr7</name>
						<description>mjpeg_start_addr7.</description>
						<addressOffset>0xB8</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_7</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_bit_cnt7</name>
						<description>mjpeg_bit_cnt7.</description>
						<addressOffset>0xBC</addressOffset>
						<fields>
							<field>
								<name>frame_bit_cnt_7</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_start_addr_8</name>
						<description>mjpeg_start_addr_8.</description>
						<addressOffset>0xC0</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_8</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_bit_cnt_8</name>
						<description>mjpeg_bit_cnt_8.</description>
						<addressOffset>0xC4</addressOffset>
						<fields>
							<field>
								<name>frame_bit_cnt_8</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_start_addr_9</name>
						<description>mjpeg_start_addr_9.</description>
						<addressOffset>0xC8</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_9</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_bit_cnt_9</name>
						<description>mjpeg_bit_cnt_9.</description>
						<addressOffset>0xCC</addressOffset>
						<fields>
							<field>
								<name>frame_bit_cnt_9</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_start_addr_a</name>
						<description>mjpeg_start_addr_a.</description>
						<addressOffset>0xD0</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_a</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_bit_cnt_a</name>
						<description>mjpeg_bit_cnt_a.</description>
						<addressOffset>0xD4</addressOffset>
						<fields>
							<field>
								<name>frame_bit_cnt_a</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_start_addr_b</name>
						<description>mjpeg_start_addr_b.</description>
						<addressOffset>0xD8</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_b</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_bit_cnt_b</name>
						<description>mjpeg_bit_cnt_b.</description>
						<addressOffset>0xDC</addressOffset>
						<fields>
							<field>
								<name>frame_bit_cnt_b</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_start_addr_c</name>
						<description>mjpeg_start_addr_c.</description>
						<addressOffset>0xE0</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_c</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_bit_cnt_c</name>
						<description>mjpeg_bit_cnt_c.</description>
						<addressOffset>0xE4</addressOffset>
						<fields>
							<field>
								<name>frame_bit_cnt_c</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_start_addr_d</name>
						<description>mjpeg_start_addr_d.</description>
						<addressOffset>0xE8</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_d</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_bit_cnt_d</name>
						<description>mjpeg_bit_cnt_d.</description>
						<addressOffset>0xEC</addressOffset>
						<fields>
							<field>
								<name>frame_bit_cnt_d</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_start_addr_e</name>
						<description>mjpeg_start_addr_e.</description>
						<addressOffset>0xF0</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_e</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_bit_cnt_e</name>
						<description>mjpeg_bit_cnt_e.</description>
						<addressOffset>0xF4</addressOffset>
						<fields>
							<field>
								<name>frame_bit_cnt_e</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>mjpeg_start_addr_f</name>
						<description>mjpeg_start_addr_f.</description>
						<addressOffset>0xF8</addressOffset>
						<fields>
							<field>
								<name>frame_start_addr_f</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
