andelf/bl702-pac/svd/bl702.svd
				</registers>
			</peripheral>
			<peripheral>
				<name>emac</name>
				<description>emac.</description>
				<baseAddress>0x4000D000</baseAddress>
				<groupName>emac</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>MODE</name>
						<description>MODE.</description>
						<addressOffset>0x0</addressOffset>
						<fields>
							<field>
								<name>rsvd_23_18</name>
								<lsb>18</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>RMII_EN</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>RECSMALL</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>PAD</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>HUGEN</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>CRCEN</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>rsvd_12_11</name>
								<lsb>11</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>FULLD</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>rsvd_9_7</name>
								<lsb>7</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>IFG</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>PRO</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>rsvd_4</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>BRO</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>NOPRE</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>TXEN</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>RXEN</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>INT_SOURCE</name>
						<description>INT_SOURCE.</description>
						<addressOffset>0x4</addressOffset>
						<fields>
							<field>
								<name>RXC</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>TXC</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>BUSY</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>RXE</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>RXB</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>TXE</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>TXB</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>INT_MASK</name>
						<description>INT_MASK.</description>
						<addressOffset>0x8</addressOffset>
						<fields>
							<field>
								<name>RXC_M</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>TXC_M</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>BUSY_M</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>RXE_M</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>RXB_M</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>TXE_M</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>TXB_M</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>IPGT</name>
						<description>IPGT.</description>
						<addressOffset>0xC</addressOffset>
						<fields>
							<field>
								<name>IPGT</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>PACKETLEN</name>
						<description>PACKETLEN.</description>
						<addressOffset>0x18</addressOffset>
						<fields>
							<field>
								<name>MINFL</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>MAXFL</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>COLLCONFIG</name>
						<description>COLLCONFIG.</description>
						<addressOffset>0x1C</addressOffset>
						<fields>
							<field>
								<name>MAXRET</name>
								<lsb>16</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>COLLVALID</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TX_BD_NUM</name>
						<description>TX_BD_NUM.</description>
						<addressOffset>0x20</addressOffset>
						<fields>
							<field>
								<name>RXBDPTR</name>
								<lsb>24</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>TXBDPTR</name>
								<lsb>16</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>TXBDNUM</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>MIIMODE</name>
						<description>MIIMODE.</description>
						<addressOffset>0x28</addressOffset>
						<fields>
							<field>
								<name>MIINOPRE</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>CLKDIV</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>MIICOMMAND</name>
						<description>MIICOMMAND.</description>
						<addressOffset>0x2C</addressOffset>
						<fields>
							<field>
								<name>WCTRLDATA</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>RSTAT</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>SCANSTAT</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>MIIADDRESS</name>
						<description>MIIADDRESS.</description>
						<addressOffset>0x30</addressOffset>
						<fields>
							<field>
								<name>RGAD</name>
								<lsb>8</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>FIAD</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>MIITX_DATA</name>
						<description>MIITX_DATA.</description>
						<addressOffset>0x34</addressOffset>
						<fields>
							<field>
								<name>CTRLDATA</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>MIIRX_DATA</name>
						<description>MIIRX_DATA.</description>
						<addressOffset>0x38</addressOffset>
						<fields>
							<field>
								<name>PRSD</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>MIISTATUS</name>
						<description>MIISTATUS.</description>
						<addressOffset>0x3C</addressOffset>
						<fields>
							<field>
								<name>MIIM_BUSY</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>MIIM_LINKFAIL</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>MAC_ADDR0</name>
						<description>MAC_ADDR0.</description>
						<addressOffset>0x40</addressOffset>
						<fields>
							<field>
								<name>MAC_B2</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>MAC_B3</name>
								<lsb>16</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>MAC_B4</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>MAC_B5</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>MAC_ADDR1</name>
						<description>MAC_ADDR1.</description>
						<addressOffset>0x44</addressOffset>
						<fields>
							<field>
								<name>MAC_B0</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>MAC_B1</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>HASH0_ADDR</name>
						<description>HASH0_ADDR.</description>
						<addressOffset>0x48</addressOffset>
						<fields>
							<field>
								<name>HASH0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>HASH1_ADDR</name>
						<description>HASH1_ADDR.</description>
						<addressOffset>0x4C</addressOffset>
						<fields>
							<field>
								<name>HASH1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>TXCTRL</name>
						<description>TXCTRL.</description>
						<addressOffset>0x50</addressOffset>
						<fields>
							<field>
								<name>TXPAUSERQ</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>TXPAUSETV</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
