andelf/bl702-pac/svd/bl702.svd
				</registers>
			</peripheral>
			<peripheral>
				<name>usb</name>
				<description>usb.</description>
				<baseAddress>0x4000D800</baseAddress>
				<groupName>usb</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>usb_config</name>
						<description>usb_config.</description>
						<addressOffset>0x0</addressOffset>
						<fields>
							<field>
								<name>sts_usb_ep0_sw_rdy</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>cr_usb_ep0_sw_rdy</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>cr_usb_ep0_sw_nack_out</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>cr_usb_ep0_sw_nack_in</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>cr_usb_ep0_sw_stall</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>cr_usb_ep0_sw_size</name>
								<lsb>16</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>cr_usb_ep0_sw_addr</name>
								<lsb>9</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>cr_usb_ep0_sw_ctrl</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>cr_usb_rom_dct_en</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>cr_usb_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>usb_lpm_config</name>
						<description>usb_lpm_config.</description>
						<addressOffset>0x4</addressOffset>
						<fields>
							<field>
								<name>sts_lpm</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>sts_lpm_attr</name>
								<lsb>20</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>cr_lpm_resp</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>cr_lpm_resp_upd</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>cr_lpm_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>usb_resume_config</name>
						<description>usb_resume_config.</description>
						<addressOffset>0x8</addressOffset>
						<fields>
							<field>
								<name>cr_res_force</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>cr_res_trig</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>cr_res_width</name>
								<lsb>0</lsb>
								<msb>10</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>usb_setup_data_0</name>
						<description>usb_setup_data_0.</description>
						<addressOffset>0x10</addressOffset>
						<fields>
							<field>
								<name>sts_setup_data_b3</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>sts_setup_data_b2</name>
								<lsb>16</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>sts_setup_data_b1</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>sts_setup_data_b0</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>usb_setup_data_1</name>
						<description>usb_setup_data_1.</description>
						<addressOffset>0x14</addressOffset>
						<fields>
							<field>
								<name>sts_setup_data_b7</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>sts_setup_data_b6</name>
								<lsb>16</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>sts_setup_data_b5</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>sts_setup_data_b4</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>usb_frame_no</name>
						<description>usb_frame_no.</description>
						<addressOffset>0x18</addressOffset>
						<fields>
							<field>
								<name>sts_ep_no</name>
								<lsb>16</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>sts_pid</name>
								<lsb>12</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>sts_frame_no</name>
								<lsb>0</lsb>
								<msb>10</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>usb_error</name>
						<description>usb_error.</description>
						<addressOffset>0x1C</addressOffset>
						<fields>
							<field>
								<name>crc16_err</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>crc5_err</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>pid_cks_err</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>pid_seq_err</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>ivld_ep_err</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>xfer_to_err</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>utmi_rx_err</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>usb_int_en</name>
						<description>USB interrupt enable</description>
						<addressOffset>0x20</addressOffset>
						<fields>
							<field>
								<name>cr_usb_err_en</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>cr_sof_3ms_en</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>cr_lpm_pkt_en</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>cr_lpm_wkup_en</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>rsvd_27_24</name>
								<lsb>24</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>cr_ep7_done_en</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>cr_ep7_cmd_en</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>cr_ep6_done_en</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>cr_ep6_cmd_en</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>cr_ep5_done_en</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>cr_ep5_cmd_en</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>cr_ep4_done_en</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>cr_ep4_cmd_en</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>cr_ep3_done_en</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>cr_ep3_cmd_en</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>cr_ep2_done_en</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>cr_ep2_cmd_en</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>cr_ep1_done_en</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>cr_ep1_cmd_en</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>cr_ep0_out_done_en</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>cr_ep0_out_cmd_en</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>cr_ep0_in_done_en</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>cr_ep0_in_cmd_en</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>cr_ep0_setup_done_en</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>cr_ep0_setup_cmd_en</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>cr_get_dct_cmd_en</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>cr_vbus_tgl_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>cr_usb_reset_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>cr_sof_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>usb_int_sts</name>
						<description>USB interrupt status</description>
						<addressOffset>0x24</addressOffset>
						<fields>
							<field>
								<name>usb_err_int</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>sof_3ms_int</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>lpm_pkt_int</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>lpm_wkup_int</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>rsvd_27_24</name>
								<lsb>24</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>ep7_done_int</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>ep7_cmd_int</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>ep6_done_int</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>ep6_cmd_int</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>ep5_done_int</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>ep5_cmd_int</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>ep4_done_int</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>ep4_cmd_int</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>ep3_done_int</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>ep3_cmd_int</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>ep2_done_int</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>ep2_cmd_int</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>ep1_done_int</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>ep1_cmd_int</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>ep0_out_done_int</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>ep0_out_cmd_int</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>ep0_in_done_int</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>ep0_in_cmd_int</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>ep0_setup_done_int</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>ep0_setup_cmd_int</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>get_dct_cmd_int</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>vbus_tgl_int</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>usb_reset_int</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>sof_int</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>usb_int_mask</name>
						<description>USB interrupt mask</description>
						<addressOffset>0x28</addressOffset>
						<fields>
							<field>
								<name>cr_usb_err_mask</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>cr_sof_3ms_mask</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>cr_lpm_pkt_mask</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>cr_lpm_wkup_mask</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>rsvd_27_24</name>
								<lsb>24</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>cr_ep7_done_mask</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>cr_ep7_cmd_mask</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>cr_ep6_done_mask</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>cr_ep6_cmd_mask</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>cr_ep5_done_mask</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>cr_ep5_cmd_mask</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>cr_ep4_done_mask</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>cr_ep4_cmd_mask</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>cr_ep3_done_mask</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>cr_ep3_cmd_mask</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>cr_ep2_done_mask</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>cr_ep2_cmd_mask</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>cr_ep1_done_mask</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>cr_ep1_cmd_mask</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>cr_ep0_out_done_mask</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>cr_ep0_out_cmd_mask</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>cr_ep0_in_done_mask</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>cr_ep0_in_cmd_mask</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>cr_ep0_setup_done_mask</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>cr_ep0_setup_cmd_mask</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>cr_get_dct_cmd_mask</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>cr_vbus_tgl_mask</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>cr_usb_reset_mask</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>cr_sof_mask</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>usb_int_clear</name>
						<description>USB interrupt clear</description>
						<addressOffset>0x2C</addressOffset>
						<fields>
							<field>
								<name>cr_usb_err_clr</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>cr_sof_3ms_clr</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>cr_lpm_pkt_clr</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>cr_lpm_wkup_clr</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>rsvd_27_24</name>
								<lsb>24</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>cr_ep7_done_clr</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>cr_ep7_cmd_clr</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>cr_ep6_done_clr</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>cr_ep6_cmd_clr</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>cr_ep5_done_clr</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>cr_ep5_cmd_clr</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>cr_ep4_done_clr</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>cr_ep4_cmd_clr</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>cr_ep3_done_clr</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>cr_ep3_cmd_clr</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>cr_ep2_done_clr</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>cr_ep2_cmd_clr</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>cr_ep1_done_clr</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>cr_ep1_cmd_clr</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>cr_ep0_out_done_clr</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>cr_ep0_out_cmd_clr</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>cr_ep0_in_done_clr</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>cr_ep0_in_cmd_clr</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>cr_ep0_setup_done_clr</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>cr_ep0_setup_cmd_clr</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>cr_get_dct_cmd_clr</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>cr_vbus_tgl_clr</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>cr_usb_reset_clr</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>cr_sof_clr</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep1_config</name>
						<description>ep1_config.</description>
						<addressOffset>0x40</addressOffset>
						<fields>
							<field>
								<name>sts_ep1_rdy</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>cr_ep1_rdy</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>cr_ep1_nack</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>cr_ep1_stall</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>cr_ep1_type</name>
								<lsb>13</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>cr_ep1_dir</name>
								<lsb>11</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>cr_ep1_size</name>
								<lsb>0</lsb>
								<msb>10</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep2_config</name>
						<description>ep2_config.</description>
						<addressOffset>0x44</addressOffset>
						<fields>
							<field>
								<name>sts_ep2_rdy</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>cr_ep2_rdy</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>cr_ep2_nack</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>cr_ep2_stall</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>cr_ep2_type</name>
								<lsb>13</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>cr_ep2_dir</name>
								<lsb>11</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>cr_ep2_size</name>
								<lsb>0</lsb>
								<msb>10</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep3_config</name>
						<description>ep3_config.</description>
						<addressOffset>0x48</addressOffset>
						<fields>
							<field>
								<name>sts_ep3_rdy</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>cr_ep3_rdy</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>cr_ep3_nack</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>cr_ep3_stall</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>cr_ep3_type</name>
								<lsb>13</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>cr_ep3_dir</name>
								<lsb>11</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>cr_ep3_size</name>
								<lsb>0</lsb>
								<msb>10</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep4_config</name>
						<description>ep4_config.</description>
						<addressOffset>0x4C</addressOffset>
						<fields>
							<field>
								<name>sts_ep4_rdy</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>cr_ep4_rdy</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>cr_ep4_nack</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>cr_ep4_stall</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>cr_ep4_type</name>
								<lsb>13</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>cr_ep4_dir</name>
								<lsb>11</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>cr_ep4_size</name>
								<lsb>0</lsb>
								<msb>10</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep5_config</name>
						<description>ep5_config.</description>
						<addressOffset>0x50</addressOffset>
						<fields>
							<field>
								<name>sts_ep5_rdy</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>cr_ep5_rdy</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>cr_ep5_nack</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>cr_ep5_stall</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>cr_ep5_type</name>
								<lsb>13</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>cr_ep5_dir</name>
								<lsb>11</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>cr_ep5_size</name>
								<lsb>0</lsb>
								<msb>10</msb>
							</field>
						</fields>
					</register>
