andelf/bl702-pac/svd/bl702.svd
					<register>
						<name>ep6_config</name>
						<description>ep6_config.</description>
						<addressOffset>0x54</addressOffset>
						<fields>
							<field>
								<name>sts_ep6_rdy</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>cr_ep6_rdy</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>cr_ep6_nack</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>cr_ep6_stall</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>cr_ep6_type</name>
								<lsb>13</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>cr_ep6_dir</name>
								<lsb>11</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>cr_ep6_size</name>
								<lsb>0</lsb>
								<msb>10</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep7_config</name>
						<description>ep7_config.</description>
						<addressOffset>0x58</addressOffset>
						<fields>
							<field>
								<name>sts_ep7_rdy</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>cr_ep7_rdy</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>cr_ep7_nack</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>cr_ep7_stall</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>cr_ep7_type</name>
								<lsb>13</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>cr_ep7_dir</name>
								<lsb>11</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>cr_ep7_size</name>
								<lsb>0</lsb>
								<msb>10</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep0_fifo_config</name>
						<description>ep0_fifo_config.</description>
						<addressOffset>0x100</addressOffset>
						<fields>
							<field>
								<name>ep0_rx_fifo_underflow</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>ep0_rx_fifo_overflow</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>ep0_tx_fifo_underflow</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>ep0_tx_fifo_overflow</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>ep0_rx_fifo_clr</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>ep0_tx_fifo_clr</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>ep0_dma_rx_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>ep0_dma_tx_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep0_fifo_status</name>
						<description>ep0_fifo_status.</description>
						<addressOffset>0x104</addressOffset>
						<fields>
							<field>
								<name>ep0_rx_fifo_full</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>ep0_rx_fifo_empty</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>ep0_rx_fifo_cnt</name>
								<lsb>16</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>ep0_tx_fifo_full</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>ep0_tx_fifo_empty</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>ep0_tx_fifo_cnt</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep0_tx_fifo_wdata</name>
						<description>ep0_tx_fifo_wdata.</description>
						<addressOffset>0x108</addressOffset>
						<fields>
							<field>
								<name>ep0_tx_fifo_wdata</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep0_rx_fifo_rdata</name>
						<description>ep0_rx_fifo_rdata.</description>
						<addressOffset>0x10C</addressOffset>
						<fields>
							<field>
								<name>ep0_rx_fifo_rdata</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep1_fifo_config</name>
						<description>ep1_fifo_config.</description>
						<addressOffset>0x110</addressOffset>
						<fields>
							<field>
								<name>ep1_rx_fifo_underflow</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>ep1_rx_fifo_overflow</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>ep1_tx_fifo_underflow</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>ep1_tx_fifo_overflow</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>ep1_rx_fifo_clr</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>ep1_tx_fifo_clr</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>ep1_dma_rx_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>ep1_dma_tx_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep1_fifo_status</name>
						<description>ep1_fifo_status.</description>
						<addressOffset>0x114</addressOffset>
						<fields>
							<field>
								<name>ep1_rx_fifo_full</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>ep1_rx_fifo_empty</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>ep1_rx_fifo_cnt</name>
								<lsb>16</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>ep1_tx_fifo_full</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>ep1_tx_fifo_empty</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>ep1_tx_fifo_cnt</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep1_tx_fifo_wdata</name>
						<description>ep1_tx_fifo_wdata.</description>
						<addressOffset>0x118</addressOffset>
						<fields>
							<field>
								<name>ep1_tx_fifo_wdata</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep1_rx_fifo_rdata</name>
						<description>ep1_rx_fifo_rdata.</description>
						<addressOffset>0x11C</addressOffset>
						<fields>
							<field>
								<name>ep1_rx_fifo_rdata</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep2_fifo_config</name>
						<description>ep2_fifo_config.</description>
						<addressOffset>0x120</addressOffset>
						<fields>
							<field>
								<name>ep2_rx_fifo_underflow</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>ep2_rx_fifo_overflow</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>ep2_tx_fifo_underflow</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>ep2_tx_fifo_overflow</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>ep2_rx_fifo_clr</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>ep2_tx_fifo_clr</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>ep2_dma_rx_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>ep2_dma_tx_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep2_fifo_status</name>
						<description>ep2_fifo_status.</description>
						<addressOffset>0x124</addressOffset>
						<fields>
							<field>
								<name>ep2_rx_fifo_full</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>ep2_rx_fifo_empty</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>ep2_rx_fifo_cnt</name>
								<lsb>16</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>ep2_tx_fifo_full</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>ep2_tx_fifo_empty</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>ep2_tx_fifo_cnt</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep2_tx_fifo_wdata</name>
						<description>ep2_tx_fifo_wdata.</description>
						<addressOffset>0x128</addressOffset>
						<fields>
							<field>
								<name>ep2_tx_fifo_wdata</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep2_rx_fifo_rdata</name>
						<description>ep2_rx_fifo_rdata.</description>
						<addressOffset>0x12C</addressOffset>
						<fields>
							<field>
								<name>ep2_rx_fifo_rdata</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep3_fifo_config</name>
						<description>ep3_fifo_config.</description>
						<addressOffset>0x130</addressOffset>
						<fields>
							<field>
								<name>ep3_rx_fifo_underflow</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>ep3_rx_fifo_overflow</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>ep3_tx_fifo_underflow</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>ep3_tx_fifo_overflow</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>ep3_rx_fifo_clr</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>ep3_tx_fifo_clr</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>ep3_dma_rx_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>ep3_dma_tx_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep3_fifo_status</name>
						<description>ep3_fifo_status.</description>
						<addressOffset>0x134</addressOffset>
						<fields>
							<field>
								<name>ep3_rx_fifo_full</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>ep3_rx_fifo_empty</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>ep3_rx_fifo_cnt</name>
								<lsb>16</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>ep3_tx_fifo_full</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>ep3_tx_fifo_empty</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>ep3_tx_fifo_cnt</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep3_tx_fifo_wdata</name>
						<description>ep3_tx_fifo_wdata.</description>
						<addressOffset>0x138</addressOffset>
						<fields>
							<field>
								<name>ep3_tx_fifo_wdata</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep3_rx_fifo_rdata</name>
						<description>ep3_rx_fifo_rdata.</description>
						<addressOffset>0x13C</addressOffset>
						<fields>
							<field>
								<name>ep3_rx_fifo_rdata</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep4_fifo_config</name>
						<description>ep4_fifo_config.</description>
						<addressOffset>0x140</addressOffset>
						<fields>
							<field>
								<name>ep4_rx_fifo_underflow</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>ep4_rx_fifo_overflow</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>ep4_tx_fifo_underflow</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>ep4_tx_fifo_overflow</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>ep4_rx_fifo_clr</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>ep4_tx_fifo_clr</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>ep4_dma_rx_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>ep4_dma_tx_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep4_fifo_status</name>
						<description>ep4_fifo_status.</description>
						<addressOffset>0x144</addressOffset>
						<fields>
							<field>
								<name>ep4_rx_fifo_full</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>ep4_rx_fifo_empty</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>ep4_rx_fifo_cnt</name>
								<lsb>16</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>ep4_tx_fifo_full</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>ep4_tx_fifo_empty</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>ep4_tx_fifo_cnt</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep4_tx_fifo_wdata</name>
						<description>ep4_tx_fifo_wdata.</description>
						<addressOffset>0x148</addressOffset>
						<fields>
							<field>
								<name>ep4_tx_fifo_wdata</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep4_rx_fifo_rdata</name>
						<description>ep4_rx_fifo_rdata.</description>
						<addressOffset>0x14C</addressOffset>
						<fields>
							<field>
								<name>ep4_rx_fifo_rdata</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep5_fifo_config</name>
						<description>ep5_fifo_config.</description>
						<addressOffset>0x150</addressOffset>
						<fields>
							<field>
								<name>ep5_rx_fifo_underflow</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>ep5_rx_fifo_overflow</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>ep5_tx_fifo_underflow</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>ep5_tx_fifo_overflow</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>ep5_rx_fifo_clr</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>ep5_tx_fifo_clr</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>ep5_dma_rx_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>ep5_dma_tx_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep5_fifo_status</name>
						<description>ep5_fifo_status.</description>
						<addressOffset>0x154</addressOffset>
						<fields>
							<field>
								<name>ep5_rx_fifo_full</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>ep5_rx_fifo_empty</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>ep5_rx_fifo_cnt</name>
								<lsb>16</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>ep5_tx_fifo_full</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>ep5_tx_fifo_empty</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>ep5_tx_fifo_cnt</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep5_tx_fifo_wdata</name>
						<description>ep5_tx_fifo_wdata.</description>
						<addressOffset>0x158</addressOffset>
						<fields>
							<field>
								<name>ep5_tx_fifo_wdata</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep5_rx_fifo_rdata</name>
						<description>ep5_rx_fifo_rdata.</description>
						<addressOffset>0x15C</addressOffset>
						<fields>
							<field>
								<name>ep5_rx_fifo_rdata</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep6_fifo_config</name>
						<description>ep6_fifo_config.</description>
						<addressOffset>0x160</addressOffset>
						<fields>
							<field>
								<name>ep6_rx_fifo_underflow</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>ep6_rx_fifo_overflow</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>ep6_tx_fifo_underflow</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>ep6_tx_fifo_overflow</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>ep6_rx_fifo_clr</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>ep6_tx_fifo_clr</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>ep6_dma_rx_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>ep6_dma_tx_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep6_fifo_status</name>
						<description>ep6_fifo_status.</description>
						<addressOffset>0x164</addressOffset>
						<fields>
							<field>
								<name>ep6_rx_fifo_full</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>ep6_rx_fifo_empty</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>ep6_rx_fifo_cnt</name>
								<lsb>16</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>ep6_tx_fifo_full</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>ep6_tx_fifo_empty</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>ep6_tx_fifo_cnt</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep6_tx_fifo_wdata</name>
						<description>ep6_tx_fifo_wdata.</description>
						<addressOffset>0x168</addressOffset>
						<fields>
							<field>
								<name>ep6_tx_fifo_wdata</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep6_rx_fifo_rdata</name>
						<description>ep6_rx_fifo_rdata.</description>
						<addressOffset>0x16C</addressOffset>
						<fields>
							<field>
								<name>ep6_rx_fifo_rdata</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep7_fifo_config</name>
						<description>ep7_fifo_config.</description>
						<addressOffset>0x170</addressOffset>
						<fields>
							<field>
								<name>ep7_rx_fifo_underflow</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>ep7_rx_fifo_overflow</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>ep7_tx_fifo_underflow</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>ep7_tx_fifo_overflow</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>ep7_rx_fifo_clr</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>ep7_tx_fifo_clr</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>ep7_dma_rx_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>ep7_dma_tx_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep7_fifo_status</name>
						<description>ep7_fifo_status.</description>
						<addressOffset>0x174</addressOffset>
						<fields>
							<field>
								<name>ep7_rx_fifo_full</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>ep7_rx_fifo_empty</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>ep7_rx_fifo_cnt</name>
								<lsb>16</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>ep7_tx_fifo_full</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>ep7_tx_fifo_empty</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>ep7_tx_fifo_cnt</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep7_tx_fifo_wdata</name>
						<description>ep7_tx_fifo_wdata.</description>
						<addressOffset>0x178</addressOffset>
						<fields>
							<field>
								<name>ep7_tx_fifo_wdata</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ep7_rx_fifo_rdata</name>
						<description>ep7_rx_fifo_rdata.</description>
						<addressOffset>0x17C</addressOffset>
						<fields>
							<field>
								<name>ep7_rx_fifo_rdata</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rsvd_0</name>
						<description>rsvd_0.</description>
						<addressOffset>0x1F0</addressOffset>
						<fields>
							<field>
								<name>rsvd_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rsvd_1</name>
						<description>rsvd_1.</description>
						<addressOffset>0x1F4</addressOffset>
						<fields>
							<field>
								<name>rsvd_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
