andelf/bl702-pac/svd/bl702.svd
					<register>
						<name>xcvr_if_config</name>
						<description>xcvr_if_config.</description>
						<addressOffset>0x1FC</addressOffset>
						<fields>
							<field>
								<name>sts_vbus_det</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>cr_xcvr_om_rx_dn</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>cr_xcvr_om_rx_dp</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>cr_xcvr_om_rx_d</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>cr_xcvr_om_rx_sel</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>cr_xcvr_force_rx_dn</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>cr_xcvr_force_rx_dp</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>cr_xcvr_force_rx_d</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>cr_xcvr_force_rx_en</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>cr_xcvr_force_tx_dn</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>cr_xcvr_force_tx_dp</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>cr_xcvr_force_tx_oe</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>cr_xcvr_force_tx_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
				</registers>
			</peripheral>
			<peripheral>
				<name>pds</name>
				<description>pds.</description>
				<baseAddress>0x4000E000</baseAddress>
				<groupName>pds</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>PDS_CTL</name>
						<description>PDS_CTL.</description>
						<addressOffset>0x0</addressOffset>
						<fields>
							<field>
								<name>cr_pds_ctrl_pll</name>
								<lsb>30</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>cr_pds_ctrl_rf</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>cr_pds_ldo_vol</name>
								<lsb>24</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>cr_pds_force_ram_clk_en</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>cr_pds_pd_ldo11</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>cr_np_wfi_mask</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>cr_pds_ram_lp_with_clk_en</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>cr_pds_ldo_vsel_en</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>cr_pds_rc32m_off_dis</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>cr_pds_rst_soc_en</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>cr_pds_soc_enb_force_on</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>cr_pds_pd_xtal</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>cr_pds_pwr_off</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>cr_pds_wait_xtal_rdy</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>cr_pds_iso_en</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>cr_sw_pu_flash</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>cr_pds_mem_stby</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>cr_pds_gate_clk</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>cr_pds_ctrl_pu_flash</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>cr_pds_ctrl_gpio_ie_pu_pd</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>cr_pds_pd_bg_sys</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>cr_pds_pd_dcdc18</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>cr_wifi_pds_save_state</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>cr_xtal_force_off</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>cr_sleep_forever</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>pds_start_ps</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>PDS_TIME1</name>
						<description>PDS_TIME1.</description>
						<addressOffset>0x4</addressOffset>
						<fields>
							<field>
								<name>cr_sleep_duration</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>PDS_INT</name>
						<description>PDS_INT.</description>
						<addressOffset>0xC</addressOffset>
						<fields>
							<field>
								<name>ro_pds_wakeup_event</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>cr_pds_wakeup_src_en</name>
								<lsb>16</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>cr_pds_int_clr</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>cr_pds_pll_done_int_mask</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>cr_pds_rf_done_int_mask</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>cr_pds_wake_int_mask</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>pds_clr_reset_event</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>pds_reset_event</name>
								<lsb>4</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>ro_pds_pll_done_int</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>ro_pds_rf_done_int</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>ro_pds_wake_int</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>PDS_CTL2</name>
						<description>PDS_CTL2.</description>
						<addressOffset>0x10</addressOffset>
						<fields>
							<field>
								<name>cr_pds_force_usb_gate_clk</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>cr_pds_force_bz_gate_clk</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>cr_pds_force_np_gate_clk</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>cr_pds_force_usb_mem_stby</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>cr_pds_force_bz_mem_stby</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>cr_pds_force_np_mem_stby</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>cr_pds_force_usb_pds_rst</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>cr_pds_force_bz_pds_rst</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>cr_pds_force_np_pds_rst</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>cr_pds_force_usb_iso_en</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>cr_pds_force_bz_iso_en</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>cr_pds_force_np_iso_en</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>cr_pds_force_usb_pwr_off</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>cr_pds_force_bz_pwr_off</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>cr_pds_force_np_pwr_off</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>PDS_CTL3</name>
						<description>PDS_CTL3.</description>
						<addressOffset>0x14</addressOffset>
						<fields>
							<field>
								<name>cr_pds_misc_iso_en</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>cr_pds_usb_iso_en</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>cr_pds_ble_iso_en</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>cr_pds_bz_iso_en</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>cr_pds_np_iso_en</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>cr_pds_force_ble_gate_clk</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>cr_pds_force_misc_gate_clk</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>cr_pds_force_ble_mem_stby</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>cr_pds_force_misc_mem_stby</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>cr_pds_force_ble_pds_rst</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>cr_pds_force_misc_pds_rst</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>cr_pds_force_ble_iso_en</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>cr_pds_force_ble_pwr_off</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>cr_pds_force_misc_pwr_off</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>PDS_CTL4</name>
						<description>PDS_CTL4.</description>
						<addressOffset>0x18</addressOffset>
						<fields>
							<field>
								<name>cr_pds_misc_dig_pwr_off</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>cr_pds_misc_ana_pwr_off</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>cr_pds_misc_gate_clk</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>cr_pds_misc_mem_stby</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>cr_pds_misc_reset</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>cr_pds_misc_pwr_off</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>cr_pds_usb_gate_clk</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>cr_pds_usb_mem_stby</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>cr_pds_usb_reset</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>cr_pds_usb_pwr_off</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>cr_pds_ble_gate_clk</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>cr_pds_ble_mem_stby</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>cr_pds_ble_reset</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>cr_pds_ble_pwr_off</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>cr_pds_bz_gate_clk</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>cr_pds_bz_mem_stby</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>cr_pds_bz_reset</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>cr_pds_bz_pwr_off</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>cr_pds_np_gate_clk</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>cr_pds_np_mem_stby</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>cr_pds_np_reset</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>cr_pds_np_pwr_off</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pds_stat</name>
						<description>pds_stat.</description>
						<addressOffset>0x1C</addressOffset>
						<fields>
							<field>
								<name>ro_pds_pll_state</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>ro_pds_rf_state</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>ro_pds_state</name>
								<lsb>0</lsb>
								<msb>3</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pds_ram1</name>
						<description>pds_ram1.</description>
						<addressOffset>0x20</addressOffset>
						<fields>
							<field>
								<name>cr_pds_ram_pgen</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>cr_pds_ram_ret2n</name>
								<lsb>4</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>cr_pds_ram_ret1n</name>
								<lsb>0</lsb>
								<msb>3</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pds_gpio_set_pu_pd</name>
						<description>pds_gpio_set_pu_pd.</description>
						<addressOffset>0x30</addressOffset>
						<fields>
							<field>
								<name>cr_pds_gpio_28_23_pu</name>
								<lsb>24</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>cr_pds_gpio_28_23_pd</name>
								<lsb>16</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>cr_pds_gpio_22_17_pu</name>
								<lsb>8</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>cr_pds_gpio_22_17_pd</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pds_gpio_int</name>
						<description>pds_gpio_int.</description>
						<addressOffset>0x40</addressOffset>
						<fields>
							<field>
								<name>pds_gpio_int_select</name>
								<lsb>8</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>pds_gpio_int_mode</name>
								<lsb>4</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>pds_gpio_int_clr</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>pds_gpio_int_stat</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>pds_gpio_int_mask</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rc32m_ctrl0</name>
						<description>rc32m_ctrl0.</description>
						<addressOffset>0x300</addressOffset>
						<fields>
							<field>
								<name>rc32m_code_fr_ext</name>
								<lsb>22</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>rc32m_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>rc32m_cal_en</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>rc32m_ext_code_en</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>rc32m_refclk_half</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>rc32m_allow_cal</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>rc32m_dig_code_fr_cal</name>
								<lsb>6</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>rc32m_cal_precharge</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>rc32m_cal_div</name>
								<lsb>3</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>rc32m_cal_inprogress</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>rc32m_rdy</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>rc32m_cal_done</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rc32m_ctrl1</name>
						<description>rc32m_ctrl1.</description>
						<addressOffset>0x304</addressOffset>
						<fields>
							<field>
								<name>rc32m_reserved</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>rc32m_clk_force_on</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>rc32m_clk_inv</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>rc32m_clk_soft_rst</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>rc32m_soft_rst</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>rc32m_test_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pu_rst_clkpll</name>
						<description>pu_rst_clkpll.</description>
						<addressOffset>0x400</addressOffset>
						<fields>
							<field>
								<name>pu_clkpll</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>pu_clkpll_sfreg</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>clkpll_pu_cp</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>clkpll_pu_pfd</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>clkpll_pu_clamp_op</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>clkpll_pu_fbdv</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>clkpll_pu_postdiv</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>clkpll_reset_refdiv</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>clkpll_reset_fbdv</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>clkpll_reset_postdiv</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>clkpll_sdm_reset</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>clkpll_top_ctrl</name>
						<description>clkpll_top_ctrl.</description>
						<addressOffset>0x404</addressOffset>
						<fields>
							<field>
								<name>clkpll_resv</name>
								<lsb>24</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>clkpll_vg11_sel</name>
								<lsb>20</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>clkpll_refclk_sel</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>clkpll_xtal_rc32m_sel</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>clkpll_refdiv_ratio</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>clkpll_postdiv</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>clkpll_cp</name>
						<description>clkpll_cp.</description>
						<addressOffset>0x408</addressOffset>
						<fields>
							<field>
								<name>clkpll_cp_opamp_en</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>clkpll_cp_startup_en</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>clkpll_int_frac_sw</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>clkpll_icp_1u</name>
								<lsb>6</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>clkpll_icp_5u</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>clkpll_sel_cp_bias</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>clkpll_rz</name>
						<description>clkpll_rz.</description>
						<addressOffset>0x40C</addressOffset>
						<fields>
							<field>
								<name>clkpll_rz</name>
								<lsb>16</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>clkpll_cz</name>
								<lsb>14</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>clkpll_c3</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>clkpll_r4_short</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>clkpll_r4</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>clkpll_c4_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>clkpll_fbdv</name>
						<description>clkpll_fbdv.</description>
						<addressOffset>0x410</addressOffset>
						<fields>
							<field>
								<name>clkpll_sel_fb_clk</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>clkpll_sel_sample_clk</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>clkpll_vco</name>
						<description>clkpll_vco.</description>
						<addressOffset>0x414</addressOffset>
						<fields>
							<field>
								<name>clkpll_shrtr</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>clkpll_vco_speed</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>clkpll_sdm</name>
						<description>clkpll_sdm.</description>
						<addressOffset>0x418</addressOffset>
						<fields>
							<field>
								<name>clkpll_sdm_bypass</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>clkpll_sdm_flag</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>clkpll_dither_sel</name>
								<lsb>24</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>clkpll_sdmin</name>
								<lsb>0</lsb>
								<msb>23</msb>
							</field>
						</fields>
					</register>
