andelf/bl702-pac/svd/bl702.svd
					<register>
						<name>clkpll_output_en</name>
						<description>clkpll_output_en.</description>
						<addressOffset>0x41C</addressOffset>
						<fields>
							<field>
								<name>clkpll_en_div2_480m</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>clkpll_en_32m</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>clkpll_en_48m</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>clkpll_en_80m</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>clkpll_en_96m</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>clkpll_en_120m</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>clkpll_en_160m</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>clkpll_en_192m</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>clkpll_en_240m</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>clkpll_en_480m</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>clkpll_test_enable</name>
						<description>clkpll_test_enable.</description>
						<addressOffset>0x420</addressOffset>
						<fields>
							<field>
								<name>clkpll_dc_tp_out_en</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>ten_clkpll</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>ten_clkpll_sfreg</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>dten_clkpll_fin</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>dten_clkpll_fref</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>dten_clkpll_fsdm</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>dten_clk32M</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>dten_clk96M</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>dten_clkpll_postdiv_clk</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
				</registers>
			</peripheral>
			<peripheral>
				<name>HBN</name>
				<description>HBN.</description>
				<baseAddress>0x4000F000</baseAddress>
				<groupName>HBN</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>HBN_CTL</name>
						<description>HBN_CTL.</description>
						<addressOffset>0x0</addressOffset>
						<fields>
							<field>
								<name>hbn_state</name>
								<lsb>28</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>sram_slp</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>sram_slp_option</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>pwr_on_option</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>rtc_dly_option</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>pu_dcdc18_aon</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>hbn_ldo11_aon_vout_sel</name>
								<lsb>19</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>hbn_ldo11_rt_vout_sel</name>
								<lsb>15</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>hbn_dis_pwr_off_ldo11_rt</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>hbn_dis_pwr_off_ldo11</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>sw_rst</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>pwrdn_hbn_rtc</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>pwrdn_hbn_core</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>trap_mode</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>hbn_mode</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>rtc_ctl</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>HBN_TIME_L</name>
						<description>HBN_TIME_L.</description>
						<addressOffset>0x4</addressOffset>
						<fields>
							<field>
								<name>hbn_time_l</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>HBN_TIME_H</name>
						<description>HBN_TIME_H.</description>
						<addressOffset>0x8</addressOffset>
						<fields>
							<field>
								<name>hbn_time_h</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>RTC_TIME_L</name>
						<description>RTC_TIME_L.</description>
						<addressOffset>0xC</addressOffset>
						<fields>
							<field>
								<name>rtc_time_latch_l</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>RTC_TIME_H</name>
						<description>RTC_TIME_H.</description>
						<addressOffset>0x10</addressOffset>
						<fields>
							<field>
								<name>rtc_time_latch</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>rtc_time_latch_h</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>HBN_IRQ_MODE</name>
						<description>HBN_IRQ_MODE.</description>
						<addressOffset>0x14</addressOffset>
						<fields>
							<field>
								<name>pin_wakeup_en</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>pin_wakeup_sel</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>irq_acomp1_en</name>
								<lsb>22</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>irq_acomp0_en</name>
								<lsb>20</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>irq_bor_en</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>reg_en_hw_pu_pd</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_aon_pad_ie_smt</name>
								<lsb>8</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>hbn_pin_wakeup_mask</name>
								<lsb>3</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>hbn_pin_wakeup_mode</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>HBN_IRQ_STAT</name>
						<description>HBN_IRQ_STAT.</description>
						<addressOffset>0x18</addressOffset>
						<fields>
							<field>
								<name>irq_stat</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>HBN_IRQ_CLR</name>
						<description>HBN_IRQ_CLR.</description>
						<addressOffset>0x1C</addressOffset>
						<fields>
							<field>
								<name>irq_clr</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>HBN_PIR_CFG</name>
						<description>HBN_PIR_CFG.</description>
						<addressOffset>0x20</addressOffset>
						<fields>
							<field>
								<name>gpadc_nosync</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>gpadc_cgen</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>pir_en</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>pir_dis</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>pir_lpf_sel</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>pir_hpf_sel</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>HBN_PIR_VTH</name>
						<description>HBN_PIR_VTH.</description>
						<addressOffset>0x24</addressOffset>
						<fields>
							<field>
								<name>pir_vth</name>
								<lsb>0</lsb>
								<msb>13</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>HBN_PIR_INTERVAL</name>
						<description>HBN_PIR_INTERVAL.</description>
						<addressOffset>0x28</addressOffset>
						<fields>
							<field>
								<name>pir_interval</name>
								<lsb>0</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>HBN_MISC</name>
						<description>HBN_MISC.</description>
						<addressOffset>0x2C</addressOffset>
						<fields>
							<field>
								<name>hbn_flash_pulldown_aon</name>
								<lsb>24</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>hbn_flash_pullup_aon</name>
								<lsb>16</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>r_bor_out</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>pu_bor</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>bor_vth</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>bor_sel</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>HBN_GLB</name>
						<description>HBN_GLB.</description>
						<addressOffset>0x30</addressOffset>
						<fields>
							<field>
								<name>sw_ldo11_aon_vout_sel</name>
								<lsb>28</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>sw_ldo11_rt_vout_sel</name>
								<lsb>24</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>sw_ldo11soc_vout_sel_aon</name>
								<lsb>16</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>hbn_clear_reset_event</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>hbn_reset_event</name>
								<lsb>8</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>ldo11_rt_iload_sel</name>
								<lsb>6</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>hbn_pu_rc32k</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>hbn_f32k_sel</name>
								<lsb>3</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>hbn_uart_clk_sel</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>hbn_root_clk_sel</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>HBN_SRAM</name>
						<description>HBN_SRAM.</description>
						<addressOffset>0x34</addressOffset>
						<fields>
							<field>
								<name>retram_slp</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>retram_ret</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>retram_emaw</name>
								<lsb>3</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>retram_ema</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>HBN_RSV0</name>
						<description>HBN_RSV0.</description>
						<addressOffset>0x100</addressOffset>
						<fields>
							<field>
								<name>HBN_RSV0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>HBN_RSV1</name>
						<description>HBN_RSV1.</description>
						<addressOffset>0x104</addressOffset>
						<fields>
							<field>
								<name>HBN_RSV1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>HBN_RSV2</name>
						<description>HBN_RSV2.</description>
						<addressOffset>0x108</addressOffset>
						<fields>
							<field>
								<name>HBN_RSV2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>HBN_RSV3</name>
						<description>HBN_RSV3.</description>
						<addressOffset>0x10C</addressOffset>
						<fields>
							<field>
								<name>HBN_RSV3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rc32k_ctrl0</name>
						<description>rc32k_ctrl0.</description>
						<addressOffset>0x200</addressOffset>
						<fields>
							<field>
								<name>rc32k_code_fr_ext</name>
								<lsb>22</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>rc32k_cal_en</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>rc32k_ext_code_en</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>rc32k_allow_cal</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>rc32k_vref_dly</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>rc32k_dig_code_fr_cal</name>
								<lsb>6</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>rc32k_cal_precharge</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>rc32k_cal_div</name>
								<lsb>3</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>rc32k_cal_inprogress</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>rc32k_rdy</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>rc32k_cal_done</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>xtal32k</name>
						<description>xtal32k.</description>
						<addressOffset>0x204</addressOffset>
						<fields>
							<field>
								<name>pu_xtal32k</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>pu_xtal32k_buf</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>xtal32k_ac_cap_short</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>xtal32k_capbank</name>
								<lsb>11</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>xtal32k_inv_stre</name>
								<lsb>9</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>xtal32k_otf_short</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>xtal32k_outbuf_stre</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>xtal32k_reg</name>
								<lsb>5</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>xtal32k_amp_ctrl</name>
								<lsb>3</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>xtal32k_ext_sel</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>xtal32k_lowv_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>xtal32k_hiz_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
